{
  "air-cooled-screw-chiller": {
    "title": "Air Cooled Screw Chiller",
    "description": "We Manufacture Air cooled screw chiller and supply them in India and all over the world, Our air-cooled screw chiller is energy efficient and also at a reasonable price. The range starts from 30 Ton to 1800 Ton, generally supplied for HVAC purposes.",
    "content": "Air Cooled Screw Chiller: The Air Cooled Screw Chiller is specifically made for extreme tropical weather conditions which will maintain the operation and energy efficiency. The entire equipment is properly manufactured and designed by maintaining the superior manufacturing and design standard of the Drycool Systems. They are very environment friendly and they can be easily installed in any requirement according to the client. All the equipment is properly tested in international parameters to offer the best possible functionalities. Contact Us We will be offering a variety of Air Cooled Screw Chiller which also includes a wide range of capacities starting from 10 tons to 400 tons. They will process the best cooling application with the comfort of the medium GWP HFCs R404, R134A, R407C, and R410A refrigerant options. Drycool Systems specifically engineering for the reliability to the design with simplicity to reduce the cost. This is the main reason for the Air Cooled Screw Chiller to have a low cost of ownership with proper and high design standards. We are having unique compressor technology which is having a direct drive, it will also be installed with two rotating parts of efficiency and high reliability with a low speed of 3600 rpm. We are having unique optimized compressor parts which are specifically designed for chilled water applications which will optimize the part-load efficiency and full load efficiency. The integrated microprocessor will offer high reliability by providing a proactive control strategy, easy interface, safety functions, simple diagnostics, etc. It is also having energy Management and automation support by using the proper engineering method of single pair of twisted wires. Drycool Systems Air Cooled screw chiller will be the appropriate choice for the perfect temperature control along with a virtual control application. Our scree chillers are ready for quick and easy installation in factory layouts, and even most of the buildings which could be the ideal choice for changing the building design appropriately. &nbsp; &nbsp; Prominent Features of Air Cooled Screw Chiller: Various features are integrated into The Air Cooled Screw Chiller which we have listed below. It is completely eco-friendly and energy-efficient. Get the friendly refrigerant R-134a operation with every piece of equipment. This is the most advanced highly reliable and efficient screw compressor coming from Europe. They are properly made and tested in the factory with the integration of flooded evaporators and DX. Every comment is completely made by properly following the highest international standards of manufacturing. Get the part load and full load energy efficiency with both multiple and single refrigeration circuits. Get fully automatic PLC-based units along with data logging and remote operation facilities. Equipment is having electronic expansion valves which would be easier to have precise temperature control and increase the efficiency of the temperature control. It is having proper step-less capacity control ranging from 25 % to 100% adapting which is specifically for varying process loads. The normal capacities are 400v/50Hz, at 5⁰C, R-134a and it is also having R-407C, R-22, and R-404A options. Also get high condensing and low FPI count, which will offer the high flow, low noise, and pressure-controlled axial fans. This will ensure high energy efficiency and even it can be operable with various harsh ambient conditions. High energy efficiency. Solution energy-saving equipment. Superior reliability. Long equipment life. Adaptive frequency drive option available. Clean energy and intelligent management. Highly durable design with the best class cop. Efficient lubrication even during the power failure. Easy interface with BMS through protocols. Ozone friendly refrigerant HFC407c & HFC134a. The complete body is made out of galvanized steel. Polyurethane paint and powder coated. It is equipped with an advanced microprocessor-based controller. World-class safety controllers for compressors and equipment. Water flow switches and antifreeze safety. Completely functionally tested. Custom-built machine inquiries are also being entertained due to specific requirements of the client. Site support along with AMC options for the entire life of the equipment. Get extended warranty options which are available for up to 10 years. Advantages of Drycool Sysyem’s Air Cooled Screw Chiller: Air cooled chillers will need less space and they can even be set up in a roof and do not require a specific mechanical room. In short, the building will have more space for business purposes rather than the Air Cooled Screw Chiller taking the majority of the room. Air Cooled Screw Chiller will cost much less during the installation process due to the less requirement of the equipment. This Chiller are having a simple design and do not need a second set of pumps for the condenser. Every Air Cooled Screw Chillers is having much less requirement for maintenance compared to water-cooled chillers. This is because it is having less equipment compared to other chillers."
  },
  "inverter-screw-chiller": {
    "title": "Inverter Screw Chiller",
    "description": "Get integrated part-load efficiency in the air-cooled inverter screw chiller and Water-cooled inverter screw chillers.",
    "content": "Inverter Screw Chiller: We have introduced the new series of compressors in our inverter screw chiller, we just have an invalid inverter along with a permanent magnet motor in the bigger motor. Get the completely integrated three-step oil separator along with automatic two-step VI sliders. Other features include an oil filter, integrated check valve, and inbuilt MODBUS communication. Contact Us It is also has improved efficiency ranging between 5% to 70% compared to any other standard screw compressor. Get integrated part-load efficiency in the air-cooled inverter screw chillers. Water-cooled inverter screw chillers are having similar functionalities and integration of equipment. The only difference between them is the compressor which is being used for the cooling system. We are offering the first screw chillers in India, as they are having more efficiency than a three-star chiller program. Get the advanced functionality of saving on power consumption which will be a great way to have a high return on investment. Every product we manufacture is made by maintaining international standards. We are offering a wide range of capacities for every product of chillers. Every chiller will have the ability to handle a varied range of cooling requirements. Every chiller is having a combination of fixed speed compressor configuration along with the inverter to offer you the best possible outcome. Our wide range of products is perfect for offering air conditioning spaces such as hospitals, offices, hotels, and industries. It will help in maintaining the large fluctuations of load throughout the day in different seasons. Effective Features of Inverter Screw Chillers: These are the major effective features that will be offered with every inverter screw chillers. The screw chillers are completely based on external VFD which will have the ability to change the speed of the screw compressors. They can easily manage the speed of screw compressors between 40 Hz to 60 Hz. Which can be roughly converted into the range between 2200 RPM to 3500 RPM. Due to the integration of the inverter, the variable speed of the chiller can be easily changed between the range of 1750 RPM to 8000 RPM. This will give them better control over the speed which makes it the most important functionality of saving the power in both lower load and part load. None of the standard screw chillers will have the functionality to use at a lower speed but the inverter functionality to use at a lower speed but the inverter variable will give complete control on the speed. This is happening because there are no oil pumps at the lower speed in the standard chiller. Get the highly intelligent monitoring and software system that will maintain the levels and speed. It will also use the automatic process to keep the system running and healthy. The majority of the motors used in the inverter-based speed chiller is having a permanent magnet motor instead of a standard motor. This is one of the major advantages of having the part-load efficiency in every chiller. We are using the industrial standard of innovative design which is having integrated inverter compressor technology."
  },
  "buy-vfd-chiller": {
    "title": "Buy VFD Chiller",
    "description": "We manufacture best quality of VFD chiller, It used for controlling the delivery of the water pressure. Buy VFD chiller in a reasonable price.",
    "content": "Our VFD chillersLet&#8217;s talk about VFD or commonly known as variable frequency drive is nothing new in the chilling industry. we are VFD Chillers Manufacturer in India. They are being exclusively used for air handling unit fans, water pumps, and cooling tower fans. It is a part of exclusive pressure technology which is present in every microprocessor-based control system. Drycool Systems is the best chiller manufacturer in India. We will be offering the option to add a variable frequency drive that will have the proper control of the pump motor. This is an additional technology that will add up to the variable speed drive chillers. This will enable the users to cut the operating cost along with the exclusive addition to the remote management features. VFD is used for controlling the delivery of the water pressure, delivery of the flow rate, or the remote pressure using the remote process sensor. It will have the ability to ensure the process parameter need to be set up directly according to the user input on the chiller system. This will enable the chiller to have a remote communication protocol and ensure high productivity. It will also enable the chiller to have multiple adjustable parameters which will give unique user process characteristics. Our team of expert engineers insured you with advanced cooling solutions for every need. You can easily get integration into a wide range of centrifugal chillers, scroll chillers, and screw chillers. One of the major advantages of having integrated water-cooled VFD chillers is that they will have very low power consumption at part load. Every chiller is equipped with an eco-friendly cooler refrigerant such as R134A. Every chiller goes through a high-end quality check-up, and it is being manufactured based on international standards of manufacturing. We manufacture and supply VFD chiller in India & Export also. VFD can be used for modulating the operating speed of every chiller based on fluctuation load. This makes it have advantages over various load applications such as multiplexes, office spaces, hospitals, hotels, and malls. Buy VFD Chillers All Product Accurate Monitoring The accurate monitoring system is being integrated to have the proper tracking of suction pressure and other types of system variables. Cost-Effective It will offer the most cost-effective functionality due to the 50% less usage of energy. High-end temperature control with energy-saving benefits without much requirement for maintenance. Get Accurate Adjustment Get accurate adjustment of compressor motor speed according to the requirement of the industry. With the implementation of proper monitoring functionality according to the functionality. Optimum Performance Various new additional imports are being included which will help in offering the optimum performance by adjustment of the compressor speed. Compressor in the chiller The compressor in the chiller is large and has a capacity of 750HP. VFD controls the motor speed whereas if it is being absent the motor will run at full speed according to the application without any control. Expert Engineers Get high-quality products from our line of expert engineers to have the best high-end customer experience."
  },
  "inverter-scroll-chiller": {
    "title": "",
    "description": "Drycool Systems is the best chiller manufacturer in India who will be offering high-end inverter scroll chillers.",
    "content": "Inverter Scroll Chiller We will be offering the best quality scroll chiller which is having an integrated inverter. We are the first company who is offering the 3-star exceeding efficiency to have the proper chiller efficiency program. We are offering the most effective power consumption by saving energy which will offer the best high return of investment for every inverter scroll chiller. Contact Us It is being manufactured using international standards using proper certification to ensure the high quality of the machinery. We are offering a wide range of capacities for the inverter scroll chillers which is ranging between 10 TR to 78 TR. Inverters called chillers can easily handle cooling requirements as they are having a combination of fixed speed compressor configuration along with inverter speed compression configurations. Get the proper air conditioning for various spaces including industries, offices, hospitals, and hotels. Inverter scroll chillers are much important to search buildings which are having large fluctuation loads throughout the day. This will enable the machinery to work effectively without any issues to ensure savings on the power consumption. Drycool Systems is the best chiller manufacturer in India who will be offering high-end inverter scroll chillers. Inverter scroll chiller is properly manufactured and maintained to work in extreme tropical conditions without any issue. It can be easy maintenance without any downtime as they are having integrated two different compressors at the same time. Inverters called chillers are available in two different varieties which include water-cooled inverter scroll chiller and air-cooled inverter scroll chiller. They are having two different ranges of capacities including 12 TR to 72 TR for the air-cooled version and 13 TR to 78 TR for the water-cooled version. It is having an installed scroll compressor that will ensure the high reliability and efficiency to have advanced technology innovative by our expert team of engineers. Important Features of Drycool System’s Inverter Scroll Chillers: Inverter scroll chillers are having touchscreen options which is much easier to operate without much configuration in manual labor. Get the quickest and easy installation with the help of our experienced and skilled technicians. Get complete satisfaction from our customer service with the proper recommendation and installation procedure in every step. Get completely silent operation due to the European origin standard of scroll chillers which is having great functionality. It will eliminate the chance of sounds while operating for a longer period without any issue. Get the most precise temperature control with every piece of equipment to properly control according to the requirement of the industry. Inverter scroll chillers are having integrated intelligent microprocessor control which will ensure the understanding of the requirement with a single configuration. Get insured anti-corrosion condenser along with the proper coating off powder which will ensure a non-rusting and corrosion-free experience in the long run without the requirement for any maintenance. We will guarantee a high return on investment with every purchase of inverters called chillers as we will ensure high-grade equipment quality for your industry."
  },
  "air-chiller": {
    "title": "Air Chiller",
    "description": "Air chillers are a type of HVAC equipment that are used to cool the air in buildings and industrial facilities. They work by removing heat from the air and transferring it to a fluid, such as water or refrigerant. They offer several advantages such as precise temperature control, improved air quality, lower cost of operation and maintenance, and energy efficiency. However, they also have some limitations such as higher initial cost and maintenance, and the need for a larger space.",
    "content": "Introduction An air chiller is a type of HVAC (heating, ventilation, and air conditioning) equipment that is used to cool the air in a building or industrial facility. Air chillers work by removing heat from the air and transferring it to a fluid, such as water or refrigerant. This cooled fluid is then used to cool the air in the building through the use of air handling units or other types of cooling equipment. One of the major benefits of using an air chiller is its ability to provide precise temperature control. Many air chillers are equipped with sophisticated controls that allow users to set and maintain specific temperature levels throughout a building or facility. This can be particularly useful in industrial settings where precise temperature control is critical to the production process. Another benefit of air chillers is their ability to improve air quality. Many air chillers are equipped with air filtration systems that remove contaminants, such as dust and allergens, from the air. This can help to improve the overall air quality in a building or facility and can be particularly beneficial for people with allergies or respiratory problems. Download Catalog DRYCOOL DAC Series Chillers come with cooling capacity from 9 TR to 30 TR with an operating temperature of 5° C to 20°C in ambient air temperatures of up to 40°C. The Air Chiller works by soaking warm temperatures from treated liquid. This sort of equipment uses air to chill the coolant and delivers air to the heat exchanger. There are several different types of air chillers available on the market, each with their own unique characteristics and advantages. Some of the most common types of air chillers include: Water-cooled air chillers: These types of air chillers use water as the fluid to transfer heat away from the air. They are often used in large industrial facilities, such as power plants and factories, where large amounts of heat need to be removed from the air. Air-cooled air chillers: As the name suggests, these types of air chillers use air as the fluid to transfer heat away from the air. They are often used in smaller buildings or facilities where the amount of heat to be removed is not as large. Screw compressor air chillers: These types of air chillers use a screw compressor to compress the refrigerant and transfer heat away from the air. They are often used in large industrial facilities and are known for their high efficiency and reliable performance. Scroll compressor air chillers: These types of air chillers use a scroll compressor to compress the refrigerant and transfer heat away from the air. They are often used in smaller buildings and facilities and are known for their low noise levels and high efficiency. Air chillers also have a lower cost of operation and maintenance than other types of HVAC equipment. Because they use a fluid, such as water or refrigerant, to transfer heat away from the air, they do not require the same level of maintenance as other types of equipment, such as boilers or electric heaters. In terms of energy efficiency, air chillers use less energy than traditional cooling methods, such as window air conditioners and portable air conditioners. They also have a longer lifespan and are more durable, which means less need for replacement and repair. However, air chillers also have some limitations. They are typically more expensive to purchase and install than other types of HVAC equipment, and they can be more complex to operate and maintain. Additionally, they can be quite large and may take up a significant amount of space, which can be a problem in smaller buildings or facilities. UNIQUE FEATURES • Energy efficient and reliable scroll compressor with hermetically sealed suction gas cooled motor. • Each model is equipped with PLC based control platform. Control features include 2 line 16 character LCD display, onboard fault indication with audio alarm. • Accurate temperature control with the help of modulating hot gas bypass valve. • Intelligent program to save energy for dual compressor chiller circuit specifically for part load application. • Display of set value and actual value on screen. • Display of return air temperature on screen. • Scroll and function buttons allow you to navigate the chiller’s control platform. • Neatly organized internal component layout. • Proven component suppliers i.e. Copeland, Danfoss, Siemens, Emerson, IFM have been chosen for ultimate reliability and availability. • All chillers are factory tested under load prior to shipment. • Finned and Tube Evaporator – high surface area due to internally grooved copper tube, generously sized for industrial environment and tested to 300 PSIG with lower pressure drop. • RTD temperature sensors yield higher precision and repeatability than thermocouples. • Three phase monitor protects against unit damage due to phase reversal or loss of phase."
  },
  "chiller-for-plastic-industry": {
    "title": "Chiller for Plastic Industry",
    "description": "We manufacture chiller for Plastic Industry. This efficient equipment is completely energy efficient due to the compressors being installed in the chiller. It is also having a recirculation pump which is completely working based on the compassion principle by proper regulation of the temperature.",
    "content": "Chiller for plastic industry: Whether it is extrusion, injection molding, blow molding, thermoforming, vacuum forming, lamination plants, tape plant or non-woven fabric plants &#8211; the plastic industry in India and all over the world is vast, high paced, and always requiring more and more chilled water. Drycool chillers have been the product of choice for many plastics molding companies because of the ability to move the chiller from press to press. Drycool also manufactures FRP Cooling Towers and keeps them in stock from 10 TR – 1000 TR at all times. Many of our clients prefer quick delivery of units, so our in-stock chillers and cooling towers can provide a quick means of solving a cooling issue fast. INJECTION MOLDING = 1 KG/TONEXTRUSION = 1 KG/TON18.14 kg/hour HDPE15.87 kg/hour LDPE &nbsp;&nbsp;&nbsp; 15.87 kg/hour Acrylic 15.87 kg/hour PP18.14 kg/hour Nylon18.14 kg/hour Derlin18.14 kg/hour Urethane20.4 kg/hour PET22.6 kg/hour PS22.6 kg/hour ABS22.6 kg/hour PC22.6 kg/hour Acetal31.7 kg/hour PVCSHEET CALENDERING 15.87 kg/hour PE27.21 kg/hour ABS27.21 kg/hour PS PROFILE 22.6 – 27.2 kg/hour HDPE22.6 – 27.2 kg/hour LDPE22.6 – 27.2 kg/hour PP22.6 – 27.2 kg/hour PET27.2 – 37 kg/hour ABS27.2 – 37 kg/hour PVCBLOW HOLDING = 1 TONVACUUM FORMING = 1 TON18.14 lbs/hour HDPE18.14 lbs/hour PET18.14 lbs/hour PVC31.75 kg/hour HDPE & LDPE31.75 kg/hour PP90.7 kg/hour PS113.3 kg/hour PVCBLOW MOULDING 18.14 KG/HR of Polyolefins = 1 Chiller Ton Cooling Required In every plastic process industry, it is required to have the proper production of high-quality products to have the proper maintenance in the machine productivity. We will offer you the proper ensuring with the machinery production which would run efficiently and smoothly. Drycool Systems provide chillers for plastic industry that will offer a cutting-edge chiller for the plastic process. We will offer a high-performing chiller for the plastic process which is manufactured by maintaining the international standard. Our team of experts is working hard to ensure the durability and quality of every chiller for the plastic Industry. Our industry is completely working on the proper perfection of the refrigeration technology to have the high-end delivery of good quality customer service. Buy Now Download We are experienced in offering the proper leadership in the engineering works which enables us to deliver the custom solution for every project. Our product will have more equipment life even any life rate of other equipment. It is an axillary cooling machine with proper integration of various features for the plastic process. Various features include temperature control, dehumidification, molding, and drying. These features will ensure the proper release of heat along with the proper cooling technique using an air-cooled or water-cooled chiller system. Chiller 4 plastic process is entirely made out of screw and scroll compressors along with the integration of water tank, evaporator, condenser, water pump, power supply, hot gas bypass, solenoid valve, dryer filter, conveying system, and mixer. This will ensure to have a more efficient performance in the overall functionality of the product in the industry. Major Features of Drycool System’s Chiller for Plastic Process: Chiller for the plastic process is ideal for various industries including injection molding which will give the proper instant cooling process to have the properly heated molding. This will help in getting the perfect product shape by saving energy and having less power consumption. The product will instantly release the internal stress of the plastic along with the grain mark. It will offer the most durable product manufacturing along with quick and fast productivity in the industry. Get connected with our team of expert engineers to get the proper understanding benefits of using a chiller for the plastic process. Get the proper functionality of the chiller for the plastic Industry with proper drying, cooling production, humidity removal, and temperature control configuration. There are various versatile components installed into the equipment to offer you the perfect operation in different fields. Product TypesProduct TypesProduct TypesExtrusion ChillerInjection Molding ChillerBlow Molding ChillerThermoforming ChillerVacuum Forming ChillerLamination Plant ChillerTape Plant ChillerNon-Woven Fabric Chiller"
  },
  "batching-plant-chiller": {
    "title": "Batching Plant Chiller",
    "description": "We manufacture batching plant chillers for concrete plant which provide customized operation of concrete mixing along with the cooling application. Our RMC chiller (Cement chiller) also called batching plant chiller is environment friendly and can be easily installed (and reused at different sites after completion of the job) in any requirement according to the client. All the equipment is properly tested in international parameters to offer the best possible functionalities. Our RMC chiller specifically design with simplicity to reduce the cost. It will ensure to have 4 degree Celsius and chilled water temperature along with the proper process requirement.",
    "content": "Batching Plant Chiller: Batching plant chiller for concrete plants are specifically designed to operate in a dusty batching site even within extreme weather conditions. It can properly work under the sun and rain and in all the harshest environments possible.All the major components in the refrigeration circuit are selected in design according to the condition and utilization of the available site. The complete study for the batching process requirement is needed to process the choice of equipment and accessories. The engineering team will have the specific expertise in the batching plant chillers which will offer the best possible option for the industry. The clients can procure Batching Plant Chiller specifically made for extreme tropical weather conditions which will maintain the operation and energy efficiency at a very affordable price.For concrete applications, the thermal load capacity is the single most determining factor in chiller buying decision. Air cooled chillers are normally installed for concrete cooling applications because of their ease of installation, however water-cooled chillers are energy efficient and hence the choice for others too. Typically, concrete is mixed into a batch that requires a particular amount of chilled water mixed in to cool the solution down after production. The chilled water provides strength to concrete which is ultimately used in the construction of metros, buildings, and other infrastructure. For Batching chillers, Drycool Design Engineers use complex algorithms to model the heat load using various inputs such as coarse aggregate, sand aggregate, amount of cement, quantity of water, inlet temperature of water and outlet temperature of water to calculate the sensible heat and the latent heat to be removed. Once, the batching chiller’s capacity is confirmed, the makeup water tanks and insulated chilled water tanks capacity are engineered and eventually the system is manufactured. RMC (CEMENT) CHILLERS: Our Batching Plant Chiller for concrete plant is properly manufactured and designed by our engineers. Typically concrete is mixed into a batch that requires a particular amount of chilled water mixed in to cool the solution down after production. Batch Cooling is the majority of the applications related to concrete and cement cooling. DRYCOOL Chillers can be used to provide Chilled Water for concrete. Contact us Download This is the main reason for the Batching Plant Chiller to have a low cost of ownership with proper and high design standards. We are having unique optimized compressor parts which are specifically designed for chilled water applications which will optimize the part-load efficiency and full load efficiency. The integrated microprocessor will offer high reliability by providing a proactive control strategy, easy interface, safety functions, simple diagnostics, etc. Prominent Features of Drycool System’s Batching Plant Chillers: Various features are integrated into the Batching Plant Chillers which we have listed below. Equipped with environment-friendly refrigerants R-404A and R-134A It is completely energy-efficient and reliable and equipped with a scroll compressor of European origin. It is equipped with a large-sized ice water storage assembly along with powerful water pumps. The electronic expansion valve is for large capacities, precise temperature control, and energy efficiency. High energy efficiency. Also get high condensing and low FPI count, which will offer coated fins. This will ensure easy maintenance and long life. Solution energy-saving equipment. Superior reliability. A fully automatic PLC-based unit is added for data login and remote operation facilities. Long equipment life. Specially designed for the lowest possible temperatures of water even without or with a reservoir. Adaptive frequency drive option available. Clean energy and intelligent management. Highly durable design with the best class cop. Efficient lubrication even during the power failure. Easy interface with BMS through protocols. Ozone friendly refrigerant HFC407c & HFC134a. The complete body is made out of galvanized steel. Polyurethane paint and powder coated. It is having a monocoque skid-mounted design for high reliability and extra ruggedness for proper mobile operation. Factory manufacture and tested tube in tube system along with shell and tube evaporators. It will offer a high flow high-pressure design along with various specific process applications. It is specially designed for handling suspended particles and fluid debris properly. Specially designed to produce ice water within the extreme conditions of 52 degrees Celsius. It is having high condensing areas and low if count which will increase the high flow and low noise with pressure control axial fans. It will offer the best energy efficiency while operating in harsh ambient conditions. Having fully automatic and step capacity control with multiple compressor operations ranging from 25 % to 100%. It will offer turnkey solutions that will provide ice water into the mixing area It is equipped with an advanced microprocessor-based controller. World-class safety controllers for compressors and equipment. Water flow switches and antifreeze safety. Completely functionally tested. Having dust and weatherproof qualities with IP 55 and IP 65 level protection. Custom-built machine inquiries are also being entertained due to specific requirements of the client. Site support along with AMC options for the entire life of the equipment. Get extended warranty options which are available for up to 5 years. Advantages of Drycool System’s Batching Plant Chillers: The batching plant chiller is a completely construction-friendly machine that will help in saving money for the builder. It will reduce the labor cost and even the concrete can be made according to the need and availability of the raw materials. It will make a concrete mixture within a few minutes to work with the proper chilling procedure. The batching plant chiller can make fresh concrete anytime it is required for the industry. It will offer the same quality of concrete in every batch according to the proper engineering equipment. Easily add all the required amounts of the mixture to have desired concrete outcome. Batching plant chiller will ensure to make a mixture according to the right amount without compromising the quality and it reduces the chance of making any wastage during the process."
  },
  "ammonia-milk-chillers": {
    "title": "Ammonia chillers",
    "description": "our ammonia chillers used in milk storage and many industries like food processing, cold storage, dairy, industrial gases, ice making.",
    "content": "Ammonia chillers we are ammonia chiller manufacturer in India, Drycool Systems ammonia milk chillers is one of the most compact chilling plants and skid mounted which is used for a white temperature range from low to medium temperature process cooling applications. This Ammonia chiller is used for milk storage. It is mostly used in various industries which include food processing, pharmaceutical, cold storage, chemical, dairy, industrial gases, ice making, etc. They are also used in various medium temperature applications which include concrete cooling, plastics, HVAC, etc. Buy Ammonia chiller in a very reasonable price. &#8220;We are a trusted milk chiller manufacturer dedicated to delivering reliable, energy-efficient cooling solutions that preserve milk freshness from farm to processing. Our milk chillers are engineered with high-grade stainless steel, advanced insulation, and precise temperature control to ensure rapid cooling, hygienic storage, and long service life. Designed to meet the demands of modern dairy operations, our systems are easy to operate, low in maintenance, and compliant with international quality standards, helping dairy farmers and processors maintain superior milk quality and maximize productivity.&#8221; Contact Us About Ammonia chillers: We are offering the best Ammonia chiller for milk storage which includes various functionalities and advancements in the technological field. Industrial chillers are supplied with cold glycol, chilled water, or brine which will have a greenhouse gas footprint and also increase the cost of ownership. It can be easy with reduced by the use of ammonia refrigerant instead of various other HFCs. As it does not contribute to ozone depletion not affect global warming. we are manufacturer of Ammonia chiller in India and we supply in All over India & World. It is the best option to choose the ammonia dealers in generally more energy-efficient than any other chiller. Packet dealers are using ammonia refrigerants which are available in every supply of the equipment. Milk chiller will have the proper production of the standardized manufacturing industries. It is also considered as one of the best alternatives for all the conventional HFC chillers basically for the application on the industrial level. Ammonia chillers will have more standardization in all the city regulations, housing details, equipment, simplified operation, Low equipment cost, and low maintenance procedures. It is much recommended to use natural refrigerant ammonia-based chillers to have better application industries and any other areas of expertise. Prominent Features of Drycool System’s Ammonia Chiller: Various features are integrated into the ammonia chiller which we have listed below. It is a highly reliable reciprocating and screw compressor that comes from the US, Europe, and Japan. It is useful for operating for the widest range of temperatures from (+) 30⁰C to (-) 40⁰C. It is equipped with various natural refrigerants like NH3 along with zero GWP and zero ODP. This ensures the highest energy efficiency with every piece of equipment. It is also customized as per sensitive and extreme environmental conditions. Everything is properly inspected and certified under the factory&#8217;s standards. High energy efficiency. Solution energy-saving equipment. Superior reliability. Long equipment life. Adaptive frequency drive option available. Clean energy and intelligent management. Highly durable design with the best class cop. Efficient lubrication even during the power failure. Easy interface with BMS through protocols. Ozone friendly refrigerant HFC407c & HFC134a. The complete body is made out of galvanized steel. Polyurethane paint and powder coated. Every piece of equipment is properly tested and assembled in the factory with the option for Recommission and dismantling at the site. It can be very helpful in case the equipment is large while installing on the installation site. Flood evaporators are properly tested and made to factory standards. Every piece of equipment is made by following the highest international standards of manufacturing to ensure the best possible functionalities. Our equipment is also having a high fouling factor it is having a large condensing area. It is also equipped with a high flow design along with extra tube thickness. Increase the energy efficiency and also have higher operational reliability with easy maintenance. Step less and step capacity control can be ranging from 25 % to 100%. It is having adaptive functionality which can vary on the process of the loads. It is equipped with an advanced microprocessor-based controller. World-class safety controllers for compressors and equipment. Water flow switches and antifreeze safety. Completely functionally tested. Custom-built machine inquiries are also being entertained due to specific requirements of the client. Site support along with AMC options for the entire life of the equipment. Get extended warranty options which are available for up to 10 years. Equipment is having customized turnkey cooling solutions integrated properly. A fully automatic PLC-based unit is added for data login and remote operation facilities. Advantages of Drycool System’s Ammonia Chiller: Ammonia is around 3 to 10% more efficient than other refrigerants. So basically, the ammonia chiller will require less electricity consumption which will also increase the production with lower operating costs. The ammonia-based refrigeration system will also cost around 10 to 20% less to build compared to other chillers. The low cost is mostly due to the installment of narrow diameter piping that can be used which is not possible in other kinds of chillers. Ammonia is less expensive compared to other refrigerants which is one of the major reasons for the low cost. Most importantly ammonia is much safer for the environment, as it is having a 0 rating on ozone depletion potential (ODP) and also a 0 rating on global warming potential (GWP)."
  },
  "brine-chillers": {
    "title": "Brine Chiller Manufacturer",
    "description": "Drycool System’s Brine Chillers will afford the demanding temperature ranging from +6⁰C to -65⁰C. We will offer a uniquely modern and compact design for every Brine Chiller. We are one of the best Brine Chiller Manufacturers, We have a hermetically sealed compressor that will have the chiller packaging with high energy-efficient technology. We supply brine chiller in India and export all over the world, We will use two stages of the integrated compressor with subcooling functionality. There are several accessories which are related which will increase the achievement of the temperature as low as -65⁰C.",
    "content": "Brine Chillers: All of the brine chiller packages are having integration with an insulated brine storage tank and recirculating pump. These brine chillers are having wide applications in electroplating plants, anodizing plants, chemical process plants, Latex cooling, laboratory application, etc. The system will offer brine or water up to -30⁰C for cooling purposes by using reciprocating or screw-type compressors. Brine Chillers are having capacities which are ranging from 3TR to 200TR and various other ranges. Contact US Brine Chiller is the best solution when the cooling medium is water along with glycol. It will only occur when the low fluid temperature is needed and even the glycol needs to be added for the cooling water to protect it from freezing. Our system will offer a constant supply of chilled propylene glycol from the range -25⁰C or +7⁰C. Ethylene glycol can only be used for such applications when the glycol circuits and not in the contact with the food products. The brine chiller is perfectly equipped with the integration of an air-cooled condenser, even it can operate with a remote air-cooled or even the evaporative condenser. The branches are best for the outdoor installation or even for the indoor installation in the missionary room depending on the requirement of the industry. The Brine Chillers are having complete equipment of special regulation mechanism which will increase unceasing smooth operation even when the temperature is -20⁰C in the ambient temperature. The Brine Chillers is having a chilled glycol pumping system and the storage tank can also contain the unit which can be assembled separately the compact metal base for easy installation. The entire pumping system is done on one circuit loop or even the secondary and primary circuits for the best stability according to the demand of the cooling. This will offer the best energy-saving option which is much needed in every kind of industry. Prominent Features of Drycool System’s Brine Chiller: Various features are integrated into the Brine Chiller which we have listed below. Equipped with environment-friendly refrigerants R-134A, R-407C, and R-410A. It is completely energy-efficient and reliable and equipped with a scroll compressor of European origin. It is equipped with an individual and separate refrigeration circuit with every compressor. The electronic expansion valve is for large capacities, precise temperature control, and energy efficiency. High energy efficiency. Also get high condensing and low FPI count, which will offer the high flow, low noise, and pressure-controlled axial fans. This will ensure high energy efficiency and even it can be operable with various harsh ambient conditions. Solution energy-saving equipment. Superior reliability. A fully automatic PLC-based unit is added for data login and remote operation facilities. Long equipment life. Adaptive frequency drive option available. Clean energy and intelligent management. Highly durable design with the best class cop. Efficient lubrication even during the power failure. Easy interface with BMS through protocols. Ozone friendly refrigerant HFC407c & HFC134a. The complete body is made out of galvanized steel. Polyurethane paint and powder coated. It is having single and multiple skid-mounted units of refrigeration circuits which also includes an oil pump and bypass mechanism. Factory manufacture and tested tube in tube system along with shell and tube evaporators. It will offer a high flow high-pressure design along with various specific process applications. It is specially designed for handling oils properly. Get a fully automatic PLC-based unit that will offer data logging facilities and remote operation. It is having high condensing areas and low if count which will increase the high flow and low noise with pressure control axial fans. It will offer the best energy efficiency while operating in Harsh ambient conditions. Having fully automatic and step capacity control with multiple compressor operations ranging from 33 % to 100%. It is equipped with an advanced microprocessor-based controller. World-class safety controllers for compressors and equipment. Water flow switches and antifreeze safety. Completely functionally tested. Custom-built machine inquiries are also being entertained due to specific requirements of the client. Site support along with AMC options for the entire life of the equipment. Get extended warranty options which are available for up to 5 years. Advantages of Drycool System’s Brine Chiller: Get upgraded technical solution due to the tube and shell type heat exchanging method. Brine Chiller of every category will provide an economical solution. Get the most advanced solution with the plate-type heat exchangers which are available for the evaporator and condensers. This functionality is available for the Water Cooled Brine Chiller system. Available in both types Water Cooled and Air Cooled systems. Having the proper integration of the latest generation technology of compressors. The compressors include hermetic, scroll, semi-hermetic, and screw. Having unique protection, control, and regulation of the device which is having microprocessor-based on analog and digital system. Get integrated heat pump systems. Easy achievement of temperatures as low as -5⁰C. It also has an insulated brine storage tank along with the recirculating pump. Get demanded temperature which is suitable for the application of various temperatures to range from +6⁰C to -50⁰C."
  },
  "hvac-chiller": {
    "title": "HVAC Chiller",
    "description": "An HVAC chiller is a mechanical device that is used to provide chilled water for a building. The main requirement for the HVAC chiller is to provide a consistent temperature of 7 deg C water to the terminal equipment chilled water coils in the building to properly maintain the temperature of conditioned air. We are one of the best HVAC Contractor in India. It works by absorbing heat from a fluid, such as water or refrigerant, and rejecting that heat to the outdoor air or a nearby water source. Chillers are typically used in large commercial and industrial buildings, such as office buildings, hospitals, and factories, where a significant amount of cooling is required. There are several types of chillers, including air-cooled, water-cooled, and evaporative cooled. Air-cooled chillers use air to reject the absorbed heat, while water-cooled chillers use water as the heat rejection medium. Evaporative-cooled chillers reject heat to the air using the process of evaporation. Each type has its own advantages and disadvantages and is best suited for certain applications.",
    "content": "HVAC Chiller Manufacturer: We are committed to providing our customers with technology that suits their needs and have introduced a wide variety of water-cooled screw chillers with eco–friendly R134a refrigerant. With ISO 9001:2008 standard-certified factories, Drycool possesses the total capability to manufacture HVAC chillers. These chillers are available in a wide range of capacities. They are easy to install and commission and can handle varying cooling requirements, aided by multiple compressor configurations. The Drycool HVAC Chillers, have a cooling capacity range from 60 to 900 TR 50Hz version using environmentally sound R134a refrigerant. These units are supplied with rotary screw compressors from Germany, UK, and Italy. The entire product line features high energy efficiency, installation ease, control flexibility, high reliability and advanced controller. The DWC/DGC series are Drycool HVAC chillers for commercial and industrial applications where installers, consultants and building owners require maximum quality and optimal performances especially at part load. Available in a wide range of capacities, each unit is tested in a state-of-the-art manufacturing facility, matching international standards, prior to their delivery – thus ensuring reliability and optimum performance.&nbsp; SALIENT FEATURES OF HVAC CHILLER: Drycool Chillers are available in a vast number of combinations of heat exchangers, compressors and motors for offering different capacities & performance parameters. A chiller may be custom matched to certain building requirements by your Drycool Sales Representatives utilizing the Computer Selection Program. Data which can be provided to you will include: Chiller Capacity.• kW Input.• Evaporator and Condenser Fluid Temperature.• Evaporator and Condenser Pressure Drop.• Evaporator and Condenser Tube Water Velocities.• Electrical Data.• Part-Load Performance.• Contact our local Drycool Sales Representative to discuss what Custom Solutions Drycool canoffer to solve your chiller selection questions. Compressor Design • Twin Screw Compressor is suitable to operate at 415V, most suited for Indian Operating Electrical Environment.• High efficiency due to the scientific profile design of screws, high-speed operation, and precision controls.• Step-less capacity control from 100% to 25% for each compressor. Consistent loading and unloading with hydraulically actuated slide valve mechanism; a rugged and trouble-free design• These are semi-hermetic type compressors and hence, easily serviceable.• Robust and proven construction with double-walled, single-housing and new slider technology.• Each compressor is provided with a self-motor protection module, PTC motor winding• protection, oil temperature protection, oil level switch and oil heaters – all these guarantees• reliability and long life.• Multistage and ultrafine, inbuilt oil-separator results in less oil carryover rate.• Double casing structure with high-strength inner ribs ensures Lower sound level.• No external oil pump is required.• Direct-driven design eliminates gear set; improves efficiency and reliability. Evaporator/ Condenser Design • Shell-and-tube type flooded type / Shell and tube DX type heat exchanger.• Flooded type evaporator 2-pass arrangement. 3-pass arrangement is available as an option.• Integral finned copper tubes to maximized heat transfer area.• Cleanable and removable copper tubes for easy serviceability• Removable water heads for service.• Victaulic Groove Water connection.• Relief valves. (Condenser)• Manufacturing of shell from high-grade steel.• Condenser design as per ASME section VIII Div 1.• Evaporator comes with 19 mm thick closed cell insulation.• Condenser design capable for full pump down operation. Electronic Expansion Valve (EXV) &#8211; Precise and Efficient Control EXVs are used to maintain a precise flow of refrigerant to the evaporator, under both full load and part-load operation of the compressor. It can precisely control superheat at the outlet of the evaporator with faster response, irrespective of the wide variation in capacity. EXVs are an improvement over conventional thermostatic expansion valves and enable reduction of energy loss and hence, improve overall efficiency of chillers. The EXV operation is controlled by an electronic controller module, which is user friendly and provides multiple application options. It is provided with battery back-up so that in case of a power failure, EXV can close positively and stop any liquid flood-back to compressor. Economizer• The economizer circuit consists of plate type heat exchanger, expansion valve and solenoid valve.• Refrigerant is sub-cooled at economizer before entering the evaporator, the flash refrigerant• from economizer is fed into compressor at intermediate pressure.• The economizer increased cooling capacity by means of the sub-cooling circuit.• Cooling capacity is increased significantly with marginal increases in kW-input, thus, unit EER is improved. PLC and HMI Control Panel Advanced PLC, HMI and Scada is a standard features on all Drycool Screw Chillers. This maintainsall analog and digital inputs to achieve precise control of the operational and protective functions ofthe unit. Direct Digital Control (DDC) allows fingertip user interaction. The easy-to-use, HMI and menu-driven software provide access to operating conditions, control set points and alarm history, displayed on an HMI. User-friendly Operation Modes • Programmed Auto Mode: Auto-start and stop are programmable for the life cycle of the machine.This minimizes operator intervention and facilitates auto-restart on power restoration after loadshedding or grid supply failure.• Auto Mode: Start-and-Stop of the unit is controlled manually by a single button. Subsequentoperation of the unit is fully automatic through microcomputer control.• Manual Mode: Facilitates testing of the unit in manual mode.• Remote mode (for Hardware BMS/PLC): Facilitates switching-on of the unit from a remote locationthrough Hardware BMS. Panels are provided with three additional digital outputs and one digitalinput (start key) hardware BMS, as a standard scope of supply. Adaptive ControlDischarge/suction pressure limiting is done by unloading. This offers the advantage of the HVAC chillerrunning unloaded, instead of tripping. In case the compressor current increases above the set valve, the sensor senses the increase and signals the PLC to unload, thus maintaining the current within the set value. Remote Monitoring & Control (Option)Drycool, as an HVAC solution provider understands the current trend of focusing on chillerplant performance and optimization. Drycool Intelligence – A division of Drycool Systems offers several solutions such as Drycool’s Shared and Value Enhancement Savings, Drycool Energy Conservation Investment Partnership to the building owner to achieve optimized chiller plant room controls, operation, and performance. Drycool’s state-wise after-sales service• A state-wise service network backs every unit.• After the initial warranty period, Drycool offers annual maintenance service schemes."
  },
  "about-us": {
    "title": "",
    "description": "Drycool Systems is one of the best chiller suppliers in India. we make industrial chiller like screw, scroll, inverter chiller, molding",
    "content": "About Our Industrial Chillers Drycool Systems is one of the best chiller suppliers in India for commercial refrigeration and air conditioning companies. We are equipped with proper HVAC system integration, investment management, core integration air conditioning production, and contract energy Management. We are completely dedicated to properly using geothermal, thermal power generation, industrial waste heat recovery, and various other new energy fields. We will be completely dedicated to the production and system development of the central air conditioning systems, solutions, and services. Our Approach: Drycool Systems will not only follow the industry standards but we will define them for others. Drycool Systems will improve the life of industry and building by collaborating with industry and building owners with the best industrial chillers. We will also contribute with the operators to the high-performance industry and building by contributing measurable conditions. We will offer over the year benefits along with proper support to the critical objective to fulfill the mission. We are determined to explore all the missions of the organization which includes industry and building itself by using financial and strategic objectives. We will take various steps and take the challenges to improve the industry and building performance. We will ensure to determine the better ways to the industry and building environment which could impact the organization for a better cause. Drycool Systems is completely committed to delivering the best sustainable performance along with knowledge and innovation for increasing life and high performance in the industry and building the organization with chillers in India. Our Innovation: Innovation is our objective and it is also our identity. Drycool Systems completely believe in the beginning of innovation is with the customer&#8217;s requirement. Complete usage of cutting-edge concepts and aggressive designs completely innovates from the challenges which are existing in the marketplace. It will completely use the infrastructure and all the changing regulations to fuel the fluctuating cost along with innovation. Our location will help various organizations to achieve their objectives and machines by receiving unique environmental needs. Customized Chillers technology is completely improved and changed over the years and Drycool Systems is proud to be a part of it. The majority of the consumers trust Drycool Systems&#8217; innovation and expertise solutions to achieve the organizational mission. Our Sustainability: We are completely committed to sustainability. Drycool Systems being the best chiller manufacturers in India completely understand the requirement for sustainable business practices due to the changes in the environment that has grown rapidly. Every customer is expecting the company’s home they are engaging with the business is aggressively committed towards sustainability. This is not only a gesture towards being a responsible environment concerned company but it is one of the future concern approaches towards various businesses. Drycool Systems will not only help the organization to achieve the industry and building mission but it is also having the goal of having energy efficiency solutions for the generations to come. Our Diversity: Drycool Systems are completely operational in various divisions which will ensure a better impact on the environmental and industrial aspects. • Manufacturing, planning, procurement, and R & D. • Administration and finance. • Sales and marketing strategy. • Parts and supplies. • HVAC maintenance along with rental chiller services. Screw chiller we manufacture screw chillers like Air-cooled screw chillers, Water-cooled Screw chillers & Inverter screw chiller also. Scroll Chillers we offer the most cost-effective scroll chillers like Air-cooled scroll chillers, Water-cooled scroll chillers & Inverter scroll chiller also. Ammonia ChillersThe use of ammonia, will maximize the performance of the machines with an overall benefit on the running costs the users have to bear. Brine Chillers Drycool System’s Brine Chillers will afford the demanding temperature ranging from +6⁰C to -65⁰C. We will offer a uniquely modern and compact design for every Brine Chillers. Chiller for Injection Molding Machine Drycool Systems will be offering chiller for Injection molding industries with a wide range of capacities from 1 ton to 400 tons. Cooling Towers Cooling Towers are heating removal devices that use water to transfer and process waste heat into the atmosphere. The cooling tower includes both industrial cooling towers and commercial cooling tower."
  },
  "our-profile": {
    "title": "Our Profile",
    "description": "Drycool Systems India Pvt. Ltd. having the business objective which is also associated with having higher benefits ensured for the customers.",
    "content": "Drycool Systems India Pvt. Ltd. having the business objective which is also associated with having higher benefits ensured for the customers. We are having our business Goodwill along with outstanding market credibility which is appreciated by all. Our company was established in the year of 1989, since then our organization is one of the front-line developer, designer, fabricator and also the delivery service of innovative and hybrid Technology designed chiller equipment. We are the experts of chiller plant manufacturer along with the designer of cold rooms to offer customized chillers according to the requirement of the customer in India. We are also involved in various markets including African countries and South East Asia. Drycool Systems is one of the best chiller manufacturers in India along with the exporting and supplying services for FRP Cooling Towers, Scroll Chillers, Screw Chillers, chilling plants, and various other equipment which are being manufactured by using cutting-edge technology. We ensure the complete delivery of the best cooling requirements with the involvement of optimum operation which is including less maintenance cost along with less operative. We&#8217;re extremely valuable clients and we ensure the best chillers in India supply to them with highly competitive advantages which will help them increase productivity along with profitability. Over the years we have developed expertise to offer the unquestionable array of industrial refrigeration services. Our experienced management team is completely equipped with proper knowledge and understanding to assist you with various products and services. We ensure the international grade equipment which is appropriate for the productivity increment in various industries. Drycool Systems will install and supply the industrial refrigeration process by manufacturing it completely from the scratch. We will also offer maintenance, consultancy services, and repair to every client. The Vision of Drycool Systems: We are determined to serve as the framework to increase sustainable growth and also it objectively describes the business. Drycool Systems is having the vision of threefold duty for portfolio, people, and productivity which will help us to have the most effective and progressive organization. The Mission of Drycool Systems: Drycool Systems is having a mission that completely highlights the major reason and the purpose of the company. The mission of the company is inspired by various creative values, movements of optimism, and innovation in the construction of equipment management. We ensure to offer the best possible services and be the best chiller supplier in India. We are completely determined to offer industrial chillers with high-end quality to increase the productivity of every industry and serve every organization. Turnkey Projects of Drycool Systems: We are having a team of professional experts and our company is completely capable of offering turnkey solutions to every client in the best possible way along with preliminary reports. We will also offer to frame technical specifications, erection and commissioning, preparing for site layout, equipment selection, etc. Reason to Choose Drycool Systems: We are always having the age of our competitors in the market as we are offering various attributes which we have mentioned below. • Prompt delivery • Reliability • Ethical business policies • Unmatched quality equipment • Complete customer satisfaction • High Team spirit. The Infrastructure of Drycool Systems: We have progressed with great success in the competitive market by using our infrastructure which also includes the in-house design and manufacturing of the equipment. We are completely focused on offering high-end products to valuable customers which will give them ultimate satisfaction with our service. There are a few of the best components which are being used by the company for manufacturing cooling products which include double enhanced copper pipes, semi-hermetic screw compressor, microprocessor-based with the advance controlling, etc. Various components are also used by the company to be installed in various machines including building presses, welding machines, fabricating machines, drilling machines, milling machines, etc. We also offer customization on various parameters which include the uses of raw materials, along with the maintenance of proper design, shape, and size."
  },
  "quality-assurance": {
    "title": "Quality Assurance",
    "description": "",
    "content": "Quality AssuranceWe are committed to ensure total quality or our products and services. we ensure total quality by choosing the highest grade and latest technology components and processes, ensuring that the final product is what our customer had desired. to ensure that most efficient after sales-service to our customers we employ technically sound engineers and train them to solve the problems independently, efficiently and timely. For us the quality means convenience and benefit, also. we always ensure that the breakdowns are kept to minimum, the parameters are accurate and the total cost, i.e. capital cost + running cost + maintenance cost, is the least. all the working people of the organisation would be fully comitted for the continual improvement of the effectiveness of the quality management system. The above said quality policy is appropriate to the purpose of the organisation and is communicated and understood within the organisation. the above stated quality policy would be reviewed for continuing suitability to the organisation. in order to implement and maintain an effective and efficient quality management system, the top management has assigned the responsibility and authority to the people to enable them to contribute to the achievement of the quality objectives and to establish their involvement, motivation and commitment. Quality Assurance by Drycool Systems: Our company is certified under ISO 9001:2000 and we are completely quality conscious and we are determined to provide a high-quality structured control program with the entire production process. You are completely focusing to deliver flawless equipment to the clients with a regular basis up-gradation of the Technologies using the skill of our workforce. We will make sure to confirm all the products have the latest industrial standards which will be maintained by proper quality testing of the equipment. We will offer various range of refrigeration system which is tested on various parameters which we have listed below. • Reliable and smooth operation. • Rapid cooling will offer high efficiency. • Dimensional accuracy. • Resistant to corrosion. • Energy consumption. • Airflow. • Constant cooling temperature maintenance."
  },
  "accreditations": {
    "title": "Accreditations",
    "description": "Drycool Systems exports its products to over 50 countries including European Union and United States. We also handle projects in many countries particularly of large sizes as well as for various highly customised applications.",
    "content": "AccreditationsDrycool Systems exports its products to over 50 countries including European Union and United States. We also handle projects in many countries particularly of large sizes as well as for various highly customised applications, like Oil & Gas, Concrete, Beverages, Pharmaceuticals, Chemicals etc. We are accredited with UL, ISO 14001:2004 and ISO 9001:2008 certifications, as well as are approved through various prestigious consultants and certifying bodies for specific and peculiar process cooling applications across the world. The design, fabrication, assembly and testing procedures at our factories conform to HTRI, ASME Section VIII/IX, TEMA C/B/R, SHELL DEP and ATEX standards, for an extensive set of specifications of the equipments and installations."
  },
  "our-clients": {
    "title": "Our Clients",
    "description": "",
    "content": "Few of our client in industry.Injection moulding industry.Pharma & chemicals industries.Pipe industries.Soap industries.Food & beverages industries.Anodising industries.Multilayers / pp films industry. S.No. Client Name Location 1 m/s surya roshni ltd. malanpur 2 m/s material movel (p) ltd. roorkee 3 m/s maeda corporation ltd. bawal 4 m/s asahi india ltd. riwari 5 m/s famex (i) pvt. ltd. noida 6 m/s inkotech (p) ltd. noida 7 m/s samwon pres.mould i. pvt. ltd. noida 8 m/s varroc industries pvt. ltd. pantnagar 9 m/s mascot polymers pvt. ltd. noida 10 m/s valient plast pvt. ltd. parwanoo 11 m/s noble mould pvt. ltd. noida 12 m/s veekay polycot ltd. gurgaon 13 m/s amba auto pvt.ltd. noida 14 m/s windsor polymer pvt.ltd. chandigarh 15 m/s ajay poly plast pvt.ltd. delhi 16 m/s avadh rubber pvt.ltd. dehradun 17 m/s parag industries pvt.ltd. dehradun 18 m/s speciality valve pvt.ltd. g. noida 19 m/s nova plast pvt.ltd. noida 20 m/s talbross ltd. manesar 21 m/s talbross ltd. dehradun 22 m/s anjani technoplast pvt.ltd. g. noida 23 m/s suzuki power (i) ltd. manesar 24 m/s quadrant ltd. dehradun 25 m/s poly medicare ltd. faridabad 26 m/s poly medicare ltd. haridwar 27 m/s henkel india ltd. baddi 28 m/s marcator healthcare ltd. muzaffarnagar 29 m/s imperial auto ltd. faridabad 30 m/s h.m. hightech. ludhiana 31 m/s anand group pvt.ltd. gurgaon 32 m/s veer vission pvt.ltd. parmanoo 33 m/s bindal batteries pvt.ltd. noida 34 m/s connect international. noida 35 m/s amitex polymers pvt.ltd. noida 36 m/s prince plastics. delhi 37 m/s sunheri seven gard pvt.ltd. delhi 38 m/s fine chem tech (i) pvt.ltd. noida 39 m/s international electron ltd. ghaziabad 40 m/s vishal transformer pvt.ltd. meerut 41 m/s tuff industries pvt.ltd. noida 42 m/s padmavati industries. roorkee S.No Client Name Location 1 m/s cris pharma pvt. ltd. dehradun 2 m/s sgs pharma pvt. ltd. nalagarh 3 m/s technica lab pvt. ltd. haridwar 4 m/s tata research & energy centre gurgaon 5 m/s prime optha pvt. ltd. noida 6 m/s polymedicare ltd. faridabad 7 m/s polymedicare ltd. haridwar 8 m/s supron industries pvt. ltd. manesar 9 m/s supron industries pvt. ltd. okhla 10 m/s nsy energy engg. gorakhpur 11 m/s bsm petro chemical pvt. ltd. meerut 12 m/s m cap marketing pvt. ltd. rai bareli 13 m/s manav rachna kendra faridabad 14 m/s ap solvex ltd. punjab 15 m/s raghu industries ghaziabad 16 m/s universal chemical ghaziabad 17 m/s boney product pvt. ltd. noida 18 m/s s.r. bio chem ltd. himachal 19 m/s jach industries pvt. ltd. haryana 20 m/s chemline industries pvt. ltd. haryana / h.p. 21 m/s maza healthcare pvt. ltd. baddi 22 m/s marcator healthcare ltd. muzaffarnagar 23 m/s kocher healthcare pvt. ltd. delhi 24 m/s lakshya healthcare pvt. ltd. baddi 25 m/s vimal organic pvt. ltd. ghaziabad 26 m/s vitromed jaipur 27 m/s sunheri seven gard pvt. ltd. delhi S.No. Client Name Location 1 m/s manmohan pipe pvt. ltd. haridwar 2 m/s tehriplastic industries pvt. ltd. haridwar 3 m/s ajay industries pvt. ltd. dehradun 4 m/s shri shaneswar industries pvt. ltd. dehradun 5 m/s windsor polymers pvt. ltd. baddi 6 m/s&nbsp; swastik pipe pvt. ltd. haridwar 7 m/s vallient plast pvt. ltd. parwanoo 8 m/s veer vission pvt. ltd. parwanoo 9 m/s material movel pvt. ltd. roorkee S.No. Client Name Location 1 m/s goramal hariram bhiwadi 2 m/s j.k.soap nepal 3 m/s swati soap gorakhpur 4 m/s parivar soap nepal 5 m/s sushi chem vanaras 6 m/s osia industries nalagarh (h.p.) 7 m/s hindustan soap industries jalandhar 8 ms fena industries noida 9 m/s shyam soap industries hoshiarpur 10 m/s. s.r.s. industries. haridwar 11 m/s. g.r.n. soap. jalandhar S.No. Client Name Location 1 m/s raja biscuits pvt. ltd. haridwar 2 m/s l.r. foods ind. pvt. ltd. faridabad 3 m/s anmol industries ltd. g. noida 4 m/s crown biscuits pvt. ltd. ghaziabad 5 m/s harwest gold ltd. alwar 6 m/s sury foods ltd. g. noida 7 m/s artec bread pvt. ltd. meerut 8 m/s kiwi food pvt. ltd. tronica city 9 m/s kiwi food pvt. ltd. delhi 10 m/s parle biscuits ltd. aurangabad 11 m/s oxyzer industries pvt. ltd. g. noida 12 m/s cheers food & bevearage pvt. ltd. patiala 13 m/s munjal foods pvt. ltd. ludhiana 14 m/s s.s. polycom. pvt. ltd. delhi 15 m/s pilakhni distillary saharanpur 16 m/s shamli distillary ltd. shamli 17 m/s shreya distillary ltd. gorakhpur 18 m/s ruchi & beverage nimrana 19 m/s bajaj hindustan ltd. pili bheet 20 m/s bajaj hindustan ltd. saharanpur 21 m/s bajaj hindustan ltd. gorakhpur 22 m/s bajaj hindustan ltd. basti 23 m/s bajaj hindustan ltd. pratapur 24 m/s bajaj hindustan ltd. walter ganj 25 m/s rollin india pvt. ltd. delhi 24 m/s p.n. saftech pvt. ltd. pantanagar 27 m/s water mill beverage ghaziabad 28 m/s dewan polymers pvt. ltd. ghaziabad 29 m/s dhampur sugar mill ltd. dhampur S.No. Client Name Location 1 m/s alu solution. lucknow 2 m/s guru kripa industries. ghaziabad 3 m/s honey well. delhi 4 m/s karisma funishing gurgaon 5 m/s y. k.k. industries ltd. bhiwadi 6 m/s deepak aerosol pvt. ltd. bhiwadi 7 m/s rajesh aluminium ltd. nepal 8 m/s bhalla exports pvt. ltd. meerut 9 m/s bhalla exports pvt. ltd. meerut 10 m/s south east ind. pvt. ltd. ghaziabad 11 m/s jaynita export pvt. ltd. sahiubabad 12 m/s kalyani aluminium ltd. jaipur 13 m/s india international ltd. noida 14 m/s b & r collection ltd. noida 15 m/s jintan international pvt. ltd. noida 16 m/s door set pvt. ltd. gurgaon 17 m/s royal aluminium ltd. jaipur 18 m/s anmol metal pvt. ltd. lucknow 24 m/s jdm bhiwadi 20 m/s jdm ghaziabad 21 m/s r.k. electroplaters gurgaon 22 m/s n.s. electroplaters gurgaon 23 m/s anya electroplating gurgaon 24 m/s ranjeet enterprises delhi 25 m/s indian coat pvt. ltd. daman 26 m/s l.s. traders ghaziabad 27 m/s bajaj locks ltd. aligarh 28 m/s hindalco aluminium ltd. son badhra 29 m/s radiant anodiser pvt. ltd. gurgaon 30 m/s vestal anodising aligarh 31 m/s castel hardware aligarh 32 m/s sachi metal ltd. patna 33 m/s seema overseas pvt. ltd. delhi 34 m/s mac &#8211; appliances pvt. ltd. jalandhar 35 m/s jaidurg aluminium nepal 36 m/s graphix mega pvt. ltd. noida 37 m/s surya aluminium lucknow 38 m/s imperial auto ltd. faridabad 39 m/s connect international noida 40 m/s swati aluminium jaipur 41 m/s uday aluminium sahibabad 42 m/s mascoat meatal aligarh 43 m/s komal hardcrom sohana 44 m/s rahul inkotech noida 45 m/s auto allied aligarh 46 m/s k.b. sam aluminium ltd. nepal 47 m/s shyam auto bhiwari 48 m/s bindal batteries pvt. ltd. noida 49 m/s singla inguvers pvt. ltd. ghaziabad S.No. Client Name Location 1 m/s rexor india ltd. faridabad 2 m/s lamicot (i) pvt. ltd. noida 3 m/s gopsons industries. noida 4 m/s wellworth packaging. delhi 5 m/s jms polymer delhi 6 m/s radha krishna industries. ghaziabad 7 m/s amco india ltd. bhiwadi 8 m/s amco india ltd. noida 9 m/s amco india ltd. baddi 10 m/s sukhi india pvt. ltd. noida 11 m/s pragati packaging pvt. ltd. jammu 12 m/s kailash packaging pvt. ltd. delhi 13 m/s shri ram lamination pvt. ltd. kanpur 14 m/s windsor polymers pvt. ltd. baddi 15 m/s marcator healthcare pvt. ltd. muzaffarnagar 16 m/s s.s. polycom. delhi 17 m/s paradise industries pvt. ltd. delhi 18 m/s flex industries ltd. bhind 19 m/s sheela foam pvt. ltd. g. noida 20 m/s prakash laminating pvt. ltd. dehradun 21 m/s packaging ware house. noida 22 m/s tavras packaging pvt. ltd. noida"
  },
  "our-team": {
    "title": "Our Team",
    "description": "",
    "content": "Drycool Systems is one of the best chiller manufacturer in India for commercial refrigeration and industrial sectors. We are equipped with the state of the art infrastructure and MEP designers with more than 25 years of experience. Here, at Drycool we are empowering latest innovations in smart technology to mitigate climate changes, eliminate electricity deficit, improve the environment, generate great returns and manufacture world class equipment and contractual energy Management"
  }
}