{
  "adsorption-dryers-heatless": {
    "title": "Adsorption Dryers ( Heatless)",
    "description": "",
    "content": "Adsorption Dryers ( Heatless)\n\n \n\n \n\n \n\n \n\n \nMicro heat regenerated adsorption dryer works in a twin-tower alternative operation mode. Compressed air enters the dryer’s tower A through valve 1A (1B is closed), then is dehydrated and dried under the unique adsorption action of the adsorbent. Finished gas flows to the gas using point through valve 5A (5B is closed); meanwhile about 5% dry air source enters tower B through valve 4B (4A is closed) after being heated by the heater, the adsorbent in which is regenerated after a certain period of heating. Cold blowing begins when heating is stopped, which cools down the adsorption bed in the dryer’s tower B (for use in the next cycle). Finally, the air is discharged into the atmosphere through muffler. \n\nBefore switching in the second half period, turn off valve 2B and open valve 1B to equalize the pressure in the two towers (to ensure pressure stability when using the gas and avoid the impact and jitter of the dryer), and the second half period work begins at the same time (the dryer’s tower B works and tower A regenerates). The process is similar to that of the previous half period. \n\nThe process is similar to that of the previous half period.\n\nThey save energy besides economising purge by reducing the loss of purge to a minimum of 50%.\n\nThey have controllers with lucid functional displays that are programmable.\n\nThey secure undisturbed operation despite tower changeovers.\n\nThe moisture load is lessened by the auto drain valves in pre and oil filters. Therefore the desiccant life is secured without any extra cost.\n\nThe inclusion of a unique purge economizer in the latest microprocessor based controller which facilitates manual setting up of the dryer load. This device can not only accept up to 3 compressor load/unload contacts but also compute the dryer load dynamically. According to these settings done, the purge can be set. Also, the purge air can be controlled according to the pressure input accepted by the controller.\n\n \n\n \n\n \n\n \n Related Portfolios \n\n \n\nRefrigerated Air Dryers\n\n \n\n \n\nAir Handling Unit\n\n \n\n \n\nPlate Heat Exchanger\n\n \n\n \n\nAir Washer\n\n \n\n \n\n \n\nAmmonia Milk Chillers\n\n \n\n \n\nShell & Tube Type Evaporator\n\n \n\n \n\nIndustrial Chillers\n\n \n\n \n\nFlange Motor\n\n \n\n \n\n \n\nWater Cooled Scroll Chillers\n\n \n\n \n\nCold Room Panels\n\n \n\n \n\nRectangular Type Cooling Tower\n\n \n\n \n\nAir Cooled Screw Chillers"
  },
  "aftercoolers": {
    "title": "Aftercoolers",
    "description": "",
    "content": "Aftercoolers\n\n The compressed air discharged from an air compressor is hot (fig. AC1-1). Compressed air at these temperatures contains large quantities of water in vapor form. As the compressed air cools this water vapor condenses into a liquid form. As an example if an aftercooler is not used, a 200 scfm compressor operating at 100 psig introduces 45 gallons of water into the compressed air system each day.\n\nLearn more about the aftercoolers eCompressedair.com offers by viewing our product selection of aftercoolers. Compressor Outlet TemperaturesCompressor Outlet Temperatures.\n\nCompressor Outlet Temperatures\n\nType of Compressor\nAverage Outlet Air Temperature (°F)\nAverage Outlet Air Temperature (°C)\n\nOil Flooded Rotary\n200\n93.3\n\nOil Free Rotary\n350\n176.6\n\n2-Stage Reciprocating\n300\n148.8\n\nCentrifugal\n225\n107.2\n\nFigure AC1-1\n\n \n\n \n\n \nAdditionally by reducing the air temperature condensate forms. Most air aftercoolers are sized to cool the air to within 5°F to 20°F (2.7°C to 11°C) of ambient air temperature. As the compressed air cools up to 75% of the water vapor present condenses to a liquid and can be removed from the system.\n\nA moisture separator installed at the discharge of the aftercooler removes most of the liquid moisture and solids from the compressed air. Utilizing centrifugal force, moisture and solids collect at the bottom of the moisture separator. An automatic drain should be used to remove the moisture and solids.\n\n \n\n \n\nFunctions\n\nLocation\n\nTypes\n\nSizing\n\nTemperature\n\nMaintenance\n\n Functions of compressed air aftercoolers\n\nCool air discharged from air compressors via the heat exchanger\n\nReduce risk of fire (Hot compressed air pipes can be a source of ignition)\n\nReduce compressed air moisture level\n\nIncrease system capacity\n\nProtect downstream equipment from excessive heat\n\nCoolers are usually sized with a CTD (Cold Temperature Difference) of 5°F, 10°F, 15°F or 20°F (2.7°C, 5.5°C, 8.3°C, or 11°C). This means that the compressed air temperature at the outlet of the aftercooler will be equal to the cooling medium temperature plus the CTD when sized at the specified inlet air temperature and flow.\n\n \n Recommended location of aftercoolers\n\nThe aftercooler should be located as close as possible to the discharge of the compressor.\n\n \n There are two basic types of air aftercoolers:\n\nair-cooled\n\nwater-cooled.\n\nThe type of aftercooler you choose depends on your preference and requirements. Compressor manufacturers may include aftercoolers within the compressor package. In general these compressors are referred to as integral aftercoolers. A stand-alone or freestanding aftercooler is a separate unit installed downstream of the compressor.\n\nAir-Cooled Aftercooler\n\nAir cooled aftercoolers (fig. AC1-2) use ambient air to cool the hot compressed air. The compressed air enters the air cooled aftercooler. The compressed air travels through either finned tubes or corrugated aluminum sheets of the aftercooler while ambient air is forced over the cooler by a motor-driven fan. The cooler, ambient air removes heat from the compressed air.\n\nBelt Guard Air Cooled Aftercooler\n\nA belt guard air-cooled aftercooler mounts to the compressor’s v-belt guard. The compressor’s belt pulley has fins designed to force ambient air over the compressor and air cooled aftercooler. The air passing over the aftercooler facilitates the heat transfer. The pulley also sends air over the compressor helping maintain proper operating temperature.\n\nWater-Cooled Pipe Line Aftercooler\n\nA water-cooled pipe line aftercooler comes in different styles. The most common style for compressed air service is a Shell and Tube Heat Exchanger/Aftercooler (fig. AC1-3). The pipe line aftercooler consists of a shell with a bundle of tubes fitted inside. Typically the compressed air flows through the tubes in one direction as water flows on the shell side in the opposite direction. Heat from the compressed air is transferred to the water. Water vapor forms as the compressed air cools. The moisture is removed by the moisture separator and drain valve. A modulating valve is recommended to maintain a consistent temperature and reduce water consumption. The tube bundles can be fixed or removable. Fixed tube bundles cost less but are more difficult to maintain than bundles that can be removed for cleaning or service.\n\nDisadvantages of a water-cooled aftercooler include high water usage and difficult heat recovery.\n\nAdvantages to using a water-cooled aftercooler include better heat transfer and no required electricity.\n\n \n Aftercooling sizing considerations\n\nMost air aftercoolers are sized to cool the air to within 5 to 20°F (2.7°C to 11°C) of ambient air or cooling water temperature. This is called the approach temperature. Always size for the hottest day with 100% relative humidity. Sizing is dependent on the temperature of the air coming from the compressor. Typically air exiting a compressor is between 180°F (82.2°C) to 350°F (176.6°C).\n\nTo select an aftercooler, determine the approach temperature requirement (temperature above the cooling medium used) for your compressed air.\n\nSpecify 5, 10, 15, or 20°F (2.7°C, 5.5°C, 8.3°C, or 11°C) over the cooling medium temperature. Consider the temperature requirements of downstream equipment like dryers and your location’s climate.Then, based on your compressor’s CFM (cubic feet per minute) and compressed air temperature, choose an aftercooler.\n\n \n Compressed Air System Components Temperature Requirements.\n\nComponent\nNormal Operating Temperature (°F)\nNormal Operating Temperature (°C)\nAverage Maximum Operating Temperature* (°F)\nAverage Maximum Operating Temperature* (°C)\n\nStandard Refrigerated Air Dryer\n100\n37.7\n130\n54.4\n\nHigh Temperature Refrigerated Air Dryer\n180\n82.2\n190\n87.7\n\nHeated Desiccant Dryer\n100\n37.7\n120\n48.8\n\nHeated Compression Desiccant Dryer\n350 \n176.6 \n375 \n190.5 \n\nPressure Swing Desiccant Dryer\n100 \n37.7 \n120 \n48.8 \n\nStandard Particulate Filter\n100 \n37.7 \n150 \n65.5 \n\nHigh Temperature Particulate Filter\n350 \n176.6 \n450 \n232.2 \n\nCoalescer Filter\n100 \n37.7 \n150 \n65.5 \n\nVapor Filter (Activated Charcoal)\n100 \n37.7 \n150 \n65.5 \n\nOil / Water Separators\n100 (condensate) \n37.7 (condensate) \n180 (condensate) \n82.2 (condensate) \n\nDrain Valves \n100 \n37.7 \n180 \n82.2 \n\nFRL’s (polycarbonate bowl)\n100 \n37.7 \n125 \n51.6 \n\nFRL’s (metal bowl)\n100 \n37.7 \n175 \n79.4 \n\nThese are industry average maximum operating temperatures provided for reference. Before buying or installing any compressed air component, check the actual maximum operating temperature for that particular product.\n\nFigure AC1-4.\n\nAn oversized aftercooler is usually cost-effective; it will produce cooler air with less moisture, reducing the requirements for the air dryer. Additionally, a larger aftercooler will have a lower pressure drop, lowering the necessary discharge pressure from the compressor. For the best results, size the aftercooler for a 1 to 2 psi pressure drop.\n\n \n \nAftercooler (water-cooled): Routinely inspect, clean, check approach temperature, pressure drop and monitor water quality.\n\nAftercooler (air-cooled): Inspect and clean on a regular basis. Check drain valves daily.\n\nProper maintenance will keep the aftercooler efficient. A dirty aftercooler results in both warmer air temperatures and increased pressure drop.\n\nRules of Thumb\n\nMost aftercoolers are sized to cool the air to an approach temperature of 5 to 20°F (2.7°C to 11°C) of ambient air temperature.\n\nSize for the hottest day with 100% relative humidity.\n\nCompressed air aftercoolers are located directly downstream of the compressor.\n\nProper maintenance will keep the aftercooler efficient. A dirty aftercooler results in both warmer air temperatures and increased pressure drop.\n\nFor every 20°F (11.1°C) rise in compressed air temperature, the moisture content of the air doubles.\n\nLearn more about the aftercoolers eCompressedair.com offers by viewing our product selection of aftercoolers.\n\n \n\n \n Related Portfolios \n\n \n\nRotary Sprinkler\n\n \n\n \n\nBottle Type Cooling Tower\n\n \n\n \n\nAdsorption Dryers ( Heatless)\n\n \n\n \n\nWater Cooled Scroll Chillers ( Single Compressor)\n\n \n\n \n\n \n\nFlange Motor\n\n \n\n \n\nForced Draft Cooling Tower\n\n \n\n \n\nAir Cooled Screw Chillers\n\n \n\n \n\nAmmonia Milk Chillers\n\n \n\n \n\n \n\nCold Room Doors\n\n \n\n \n\nAir Cooled Screw Chillers (Single Compressor)\n\n \n\n \n\nAir Washer\n\n \n\n \n\nPlate Heat Exchanger"
  },
  "air-cooled-screw-chiller": {
    "title": "Air Cooled Screw Chillers (Single Compressor)",
    "description": "",
    "content": "Air Cooled Screw Chillers (Single Compressor)\n\n We are engaged in manufacturing Air Cooled Screw Chiller – Single Compressor, which is fully microprocessor based suitable for process cooling applications from (+) 20°c up to 40°c and for low lower temperatures of up to (-) 50°c please refer brine chillers. These are fabricated in with an option of using cfc free refrigerants r-407c & r-134a complete with in-built process pump and stainless steel chilled water expansion tank and are also rated for an ambient of up to (+) 50°c. The air cooled screw chillers are manufactured with highly reputed screw compressors from bitzer (Germany) and frascold (Italy).\n\nThe various operating voltages of these chillers are:\n\n380 / 400 volt ac / 50 hz.\n\n460 volt ac / 50 hz.\n\n380 volt ac / 60 hz.\n\n460 volt ac / 60 hz.\n\n \n\n \n\n \n\n \n\nSingle Compressors\n\n \n\nModel \nCapacity (TR) \nQTY. \nFlow Rate (CMH) \n\nDCS-A-25 \n25 TR \n1 \n15.0 \n\nDCS-A-35 \n35 TR \n1 \n21.0 \n\nDCS-A-45 \n45 TR \n1 \n27.0 \n\nDCS-A-50 \n50 TR \n1 \n30.0 \n\nDCS-A-70 \n70 TR \n1 \n42.0 \n\nDCS-A-80 \n80 TR \n1 \n48.0 \n\nDCS-A-110 \n110 TR \n1 \n66.0 \n\n \n\n \n Related Portfolios \n\n \n\nAir Cooled Scroll Chillers\n\n \n\n \n\nIndustrial Chillers\n\n \n\n \n\nWater Cooled Screw Chillers (Single Compressor)\n\n \n\n \n\nAir Handling Unit\n\n \n\n \n\n \n\nBottle Type Cooling Tower\n\n \n\n \n\nShell & Tube Type Condenser\n\n \n\n \n\nAir Receivers\n\n \n\n \n\nRefrigerated Air Dryers\n\n \n\n \n\n \n\nCold Rooms\n\n \n\n \n\nSprinkler Fan\n\n \n\n \n\nAdsorption Dryers ( Heatless)\n\n \n\n \n\nBrine Chillers"
  },
  "air-cooled-screw-chillers": {
    "title": "Air Cooled Screw Chillers",
    "description": "",
    "content": "Air Cooled Screw Chillers (Multiple Compressor)\n\n Our company offers Air Cooled Screw Chiller – Multiple Compressors, which is fabricated in our ISO 9001:2008 certified manufacturing unit factory with an option of using cfc free refrigerants r-407c & r-134a complete with in-built process pump and stainless steel chilled water expansion tank. Utilizing highly reputed screw compressors from bitzer (Germany) and frascold (Italy), these air cooled screw chillers are fully microprocessor based suitable for process cooling applications from (+) 20°c up to (-) 40°c and for lower temperatures of up to (-) 50°c.\n\nThe various operating voltages of these chillers are:\n\n380 / 400 volt ac / 50 hz.\n\n460 volt ac / 50 hz.\n\n380 volt ac / 60 hz.\n\n460 volt ac / 60 hz.\n\n \n\n \n\n \n\n \n\nMultiple Compressors\n\n \n\nModel \nCapacity (TR) \nQTY. \nFlow Rate (CMH) \n\nDCM-A-120 \n120 TR \n2 \n72.0 \n\nDCM-A-145 \n145 TR \n2 \n87.0 \n\nDCM-A-175 \n175 TR\n2 \n105.0 \n\nDCM-A-240 \n240 TR \n2 \n144.0 \n\nDCM-A-290 \n290 TR \n2 \n174.0 \n\nDCM-A-350 \n350 TR \n2 \n210.0 \n\n \n\n \n Related Portfolios \n\n \n\nCold Room Refrigeration Equipments\n\n \n\n \n\nSquare Type Cooling Tower\n\n \n\n \n\nWater Cooled Scroll Chillers\n\n \n\n \n\nAmmonia Milk Chillers\n\n \n\n \n\n \n\nShell & Tube Type Condenser\n\n \n\n \n\nCold Room Panels\n\n \n\n \n\nAir Cooled Scroll Chillers (Single Compressor)\n\n \n\n \n\nWater Cooled Screw Chillers (Single Compressor)\n\n \n\n \n\n \n\nCold Room Doors\n\n \n\n \n\nIndustrial Chillers\n\n \n\n \n\nCold Rooms\n\n \n\n \n\nShell & Tube Type Evaporator"
  },
  "air-cooled-scroll-chiller": {
    "title": "Air Cooled Scroll Chillers (Single Compressor)",
    "description": "",
    "content": "Air Cooled Scroll Chillers (Single Compressor)\n\n The Air Cooled Chillers are suitable for working in extreme tropical weather conditions with maintaining energy and operational efficiency. The equipment is designed and manufactured in compliance with superior designing and manufacturing standards. The environmental friendly chillers are easy to install and are tested on all the required international parameters to be at par with the best.\n\n \n\n \n\n \n\n \n\nSpecifications\n\n \n\nMODEL\nCAPACITY\nCOMPRESSORS\nFLOW RATE\n\nDCS AST \nTR\n \nCMH\n\nDCS-A-3\n3 TR\n1\n1.8\n\nDCS-A-5\n5 TR\n1\n3.0\n\nDCS-A-6\n6 TR\n1\n3.6\n\nDCS-A-8\n8 TR\n1\n4.8\n\nDCS-A-10\n10 TR\n1\n6.0\n\nDCS-A-12\n12 TR\n1\n7.2\n\nDCS-A-15\n15 TR\n1\n9.0\n\nDCS-A-20\n20 TR\n1\n12.0\n\nDCS-A-25\n25 TR\n1\n15.0\n\nDCS-A-30\n30 TR\n1\n18.0\n\n \n\n \n Related Portfolios \n\n \n\nAir Washer\n\n \n\n \n\nSprinkler Fan\n\n \n\n \n\nBottle Type Cooling Tower\n\n \n\n \n\nCold Room Refrigeration Equipments\n\n \n\n \n\n \n\nWater Cooled Screw Chillers (Single Compressor)\n\n \n\n \n\nForced Draft Cooling Tower\n\n \n\n \n\nWater Cooled Screw Chiller\n\n \n\n \n\nAir Cooled Scroll Chillers\n\n \n\n \n\n \n\nCold Rooms\n\n \n\n \n\nFlange Motor\n\n \n\n \n\nShell & Tube Type Evaporator\n\n \n\n \n\nCold Room Doors"
  },
  "air-cooled-scroll-chillers": {
    "title": "Air Cooled Scroll Chillers",
    "description": "",
    "content": "Air Cooled Scroll Chillers (Multiple Compressor)\n\n The Air-cooled Scroll Chillers are highly energy efficient and are perfectly designed to work within extreme tropical weather conditions. Supported with European origin compressors, these chillers are designed, manufactured and tested in conformation with international industrial standards. The chillers are operation friendly, easy to install and backed by competent engineering team to realize the advantage while being in operation.\n\nWithin a multiple compressor configuration, each compressor is supported by an individual and separate refrigeration circuit. The separate refrigeration circuit makes the servicing of under-maintenance modules easy, simultaneous to working module being on duty. The equipment is compact and contains fluid pump as well as storage tank on skid.\n\n \n\n \n\n \n\n \n\nSpecifications\n\n \n\nMODEL\nCAPACITY\nCOMPRESSORS\nFLOW RATE\n\nDCM AST \nTR\n \nCMH\n\nDCM-A-10\n10 TR\n2\n6.0\n\nDCM-A-12\n12 TR \n2\n7.2\n\nDCM-A-15\n15 TR\n2\n9.0\n\nDCM-A-20\n20 TR\n2\n12\n\nDCM-A-25\n25 TR\n2\n15\n\nDCM-A-30\n30 TR\n2\n18\n\nDCM-A-40\n40 TR\n2\n24\n\n \n\n \n Related Portfolios \n\n \n\nWater Cooled Scroll Chillers\n\n \n\n \n\nCold Room Doors\n\n \n\n \n\nAdsorption Dryers ( Heatless)\n\n \n\n \n\nAir Washer\n\n \n\n \n\n \n\nPlate Heat Exchanger\n\n \n\n \n\nRectangular Type Cooling Tower\n\n \n\n \n\nAir Cooled Scroll Chillers (Single Compressor)\n\n \n\n \n\nAir Cooled Screw Chillers (Single Compressor)\n\n \n\n \n\n \n\nSquare Type Cooling Tower\n\n \n\n \n\nCold Rooms\n\n \n\n \n\nWater Cooled Scroll Chillers ( Single Compressor)\n\n \n\n \n\nRefrigerated Air Dryers"
  },
  "air-handling-unit": {
    "title": "Air Handling Unit",
    "description": "",
    "content": "Air Handling Unit\n\n Primary cooling coil for air handling unit \n\nAbstract : In this write up, an energy-saving device is introduced into the air-handling unit (AHU). Due to increases in energy costs, energy saving devices or systems have become the new preferred trend in tropical countries. A primary cooling coil system is incorporated into the AHU to recycle the condensate water in order to achieve energy savings.\n\n The warm outside fresh air is drawn through the primary cooling coil to recover the latent heat of condensate water. The large temperature gradient between the warm fresh air and condensate water enlarges the amount of energy recovered. This system is well applicable to primary AHU which serves primary air to the air-conditioning system. The cost of installing the device is negligible but in returning long term saving. Furthermore, the de-cooled condensate water can be drained off through non-insulated drain pipe. The idea generation is discussed in the introduction.\n\n Chapters 2 and 3 describe the preliminary calculation of the energy saving percentage. Chapter 4 shows the detailed theoretical study of the development of the energy saving system. This shows the viability of the idea. Chapter 5 will recommend the design of the primary cooling coil configuration to achieve the desired cooling effect and energy saving strategy. Lastly, the conclusion of the whole study is presented.\n\n \n\n \n\n \n\n \n\n \n Related Portfolios \n\n \n\nWater Cooled Scroll Chillers\n\n \n\n \n\nAir Cooled Scroll Chillers (Single Compressor)\n\n \n\n \n\nRefrigerated Air Dryers\n\n \n\n \n\nCold Room Refrigeration Equipments\n\n \n\n \n\n \n\nCold Rooms\n\n \n\n \n\nAmmonia Milk Chillers\n\n \n\n \n\nAdsorption Dryers ( Heatless)\n\n \n\n \n\nPVC Fills\n\n \n\n \n\n \n\nFilters\n\n \n\n \n\nIndustrial Chillers\n\n \n\n \n\nShell & Tube Type Evaporator\n\n \n\n \n\nAir Receivers"
  },
  "air-receivers": {
    "title": "Air Receivers",
    "description": "",
    "content": "Air Receivers\n\n Air receivers are tanks used for compressed air storage and are recommended to be in all compressed air systems. Using air receivers of unsound or questionable construction can be very dangerous. Therefore, the American Society of Mechanical Engineers (ASME) has developed a code regarding the construction of unfired pressure vessels, which has been incorporated into many federal, state, and local laws. This particular code is ASME Code Section VIII Division 1. Air receivers should always meet or exceed this code in addition to any other state, municipal, or insurance codes that may apply.\n\nBrowse our selection of Air Receiver Tanks or call us toll-free: 866-650-1937 if you have any questions. Learn more with this helpful article about. \n\nHow to size an air reciever tank.\n\nThe ASME also approves the receiver accessories. They are equipped with a safety valve, which is set at a pressure lower than the working pressure for which the air receiver was stamped and at a higher pressure than the operating pressure, to safeguard against excessive pressure. In addition, receivers have a drain valve to eliminate accumulated moisture. They also have pressure gauges, handholes or manholes, and a base for vertical air receivers. Standard receivers are designed for horizontal or vertical mounting.\n\nAir receivers serve several important purposes:\n\nDecrease wear and tear on the compression module, capacity control system and motor by reducing excessive compressor cycling.\n\nEliminate pulsations from the discharge line.\n\nSeparate some of the moisture, oil and solid particles that might be present from the air as it comes from the compressor or that may be carried over from the aftercooler.\n\n Help reduce dew point and temperature spikes that follow regeneration.\n\nOffer additional storage capacity made to compensate for surges in compressed air usage.\n\nContribute to reduced energy costs by minimizing electric demand charges associated with excessive starting of the compressor motor.\n\n \n\n \n\n \n\n \nThe benefit of extra storage capacity alone outweights the additional cost of this component.\n\nWet vs. Dry Receiver\n\nAir Receiver Sizing\n\nInstallation Recommendations\n\nMaintenance Requirements\n\n \n\nThere are wet air receivers (supply) and dry air receivers (demand).\n\n \n\nWet Receivers: Wet receivers provide additional storage capacity and reduce moisture. The large surface area of the air receiver acts as a free cooler, which is what removes the moisture. Because the moisture is being reduced at this point in the system, the load on filters and dryers will be reduced. The term “wet receiver” refers to the storage vessel or tank placed immediately after the compressor. This device helps with contaminant removal, pressure stabilization and\n\npulsation reduction.\n\nDry Receivers: When sudden large air demands occur, dry air receivers should have adequate capacity to minimize a drop in system air pressure. If these pressure drops were not minimized here. The performance of air dryers and filters would be reduced because they would no longer be operating within their original design parameters.The term “dry receiver” refers to the receiver placed after the air dryer and other air preparation equipment.\n\n \n The size of the air receiver is dependent upon air usage and the compressor style. The general rule to size a air receiver is:\n\nReceiver Size = Compressor ACFM * 1 Gallon/ACFM.\n\nFor a 200 ACFMCompressor = 200 Gallons.\n\nWith a Conversion Factor of 7.48 Gallons/Cubic Ft. = 27 Cubic Ft.\n\n \n Wet receivers should be installed downstream of the moisture separator and before other purification equipment. Dry receivers are installed after purification equipment. All air receivers should be on blocks or some other small foundation to keep them dry and rust-free. There also should be enough space left around the receiver to allow for easy draining.\n\nExercise care when installing air receivers outdoors because any condensed moisture may freeze and interfere with the operation of drain valves, pressure gauges and safety valves. Never install a valve between the air receiver and the safety valve. The exhaust from the safety valves should be directed away from personnel and in a way that the thrust will tighten threaded pipe fittings if it lifts and blows, as opposed to unthreading them.\n\nPressure gauges should be of good quality and large enough to read while standing on the floor. Install an isolation valve between the gauge and the tank so that the gauge can be removed and replaced or recalibrated every six months without depressurizing the tank. It is essential that air receivers have an automatic trap/drainage system. Also, the receiver needs to be bolted or clamped to the floor or base on which it is mounted in case of a line fracture.\n\n \n Moisture should be drained from the receiver regularly, especially in cold weather to avoid problematic accumulation. If you need to add any braces, struts, base supports or nozzles to an air receiver, use an ASME Coded weld shop for any welding or repairs. Many companies have a policy to annually hydrotest the air receiver’s integrity. Besides hydrotesting, older air receivers should be checked periodically with an ultrasonic thickness gauge or meter. Corrosion effects can be determined by comparing readings of head and shell to the nameplate.\n\nBrowse our selection of Air Receiver Tanks or call us toll-free: 866-650-1937 if you have any questions.\n\n \n\n \n Related Portfolios \n\n \n\nCold Room Doors\n\n \n\n \n\nCold Room Refrigeration Equipments\n\n \n\n \n\nPVC Fills\n\n \n\n \n\nAir Cooled Scroll Chillers\n\n \n\n \n\n \n\nSprinkler Fan\n\n \n\n \n\nWater Cooled Scroll Chillers ( Single Compressor)\n\n \n\n \n\nCold Room Panels\n\n \n\n \n\nAir Handling Unit\n\n \n\n \n\n \n\nRotary Sprinkler\n\n \n\n \n\nOil Chillers\n\n \n\n \n\nWater Cooled Screw Chillers (Single Compressor)\n\n \n\n \n\nSquare Type Cooling Tower"
  },
  "air-washer": {
    "title": "Air Washer",
    "description": "",
    "content": "Air Washer\n\n Our enterprise has gained immense recognition in manufacturing, exporting and supplying a quality assured array of Air Washer. Our offered washer is widely used for removing dust particles from the air. The washer provided by us is manufactured by making use of excellent grade components with the aid of advanced techniques in line with international quality standards. Apart from this, clients can avail this Air Washer from us at rock bottom prices.\n\n \n\n \n\n \n\n \n\nFeatures\n\nSpecification\n\n \nExcellent functionality.\n\nRugged design.\n\nImpeccable finish.\n\nEnhanced durability.\n\n \n Capacity Available for Air Washer :\n\n2000 to 40000 CFM with single Blower & 4000 to 80000 CFM with Single & multiple blowers. \n\nBase Frame of Air Washer:\n\nThe total assembly is mounted on a horizontal member of heavy Mild steel channel.\n\nAir Washer Fan Section :\n\nConstructed in GI/SS Sheet with Inspection Doors.\n\nWet Section :\n\nConstructed in GI/SS Sheet.\n\nWater Tank Structure of Air Washer :\n\nConstructed in GI with Frp coated/SS\n\nAir Washer Blower :\n\nDynamically Balaced Forward Curved, DIDW Type Make DRYCOOL / Imported.\n\nCellulose Paper Pad :\n\nImported HUTEK, Munters\n\nAir Washer Electric Motor :\n\nThree Phase, TEFC squirrel cage induction motor of standard makes (Crompton, ABB and Kirloskar etc.).\n\nDrive Pulley :\n\nV-Groove with/without Taper Lock hub.\n\nV-Belts :\n\nFenner make.\n\nPump:\n\nMonoblock make Crompton / Kirloskar.\n\nFilter used in Air Washer:\n\nHDPE/Aluminum/GI Mesh Filter, Micro Vee, Hepa as per requirement.\n\nPipe Fittings in Air washer :\n\nPVC piping with all Necessary fittings such as float valve, quick fill, overflow & drain ports.\n\nMODEL\nCFM\nBLOWER SIZEIN (mm)\nQTY.\nMOTOR HP\nPUMP HP\nElectric KWH\nWater LPH\nSIZE WxLxH (Ft.)\n\nDECS-5\n5000\n450\n1\n1.5\n0.25\n1.1\n50\n3.6×7.0x5.5\n\nDECS-6\n6000\n500\n1\n2.0\n0.25\n1.5\n60\n3.6×7.0x5.5 \n\nDECS-8\n8000\n560\n1\n3.0\n0.50\n2.2\n80\n4.0×7.0x5.5 \n\nDECS-10\n10000\n610\n1\n5.0\n0.50\n3.7\n100\n5.0×7.0x5.5 \n\nDECS-12\n12000\n610\n1\n5.0\n0.50\n3.7\n120\n6.0×7.0x5.5 \n\nDECS-16\n16000\n630\n1\n7.5\n1.00\n5.5\n160\n7.0×8.0x6.5 \n\nDECS-20\n20000\n710\n1\n10.0\n1.00\n7.5\n200\n8.0×8.0x7.0 \n\nDECS-25\n25000\n800\n1\n12.5\n1.00\n10.1\n240\n10×8.5×7.5 \n\nDECS-30\n30000\n900\n1\n15.0\n1.00\n11.5\n300\n12×8.5×7.5 \n\nDECS-40\n40000\n1000\n1\n20.0\n1.00\n15.0\n300\n13×9.0x8.0 \n\nDECS-45\n45000\n1000\n1\n20.0\n1.00\n15.0\n360\n15×9.0x8.0 \n\nDECS-50\n50000\n1000\n1\n25.0\n1.00\n18.7\n380\n16×9.0x8.0\n\n \n\n \n Related Portfolios \n\n \n\nBrine Chillers\n\n \n\n \n\nCold Room Doors\n\n \n\n \n\nAmmonia Milk Chillers\n\n \n\n \n\nRectangular Type Cooling Tower\n\n \n\n \n\n \n\nAir Cooled Scroll Chillers\n\n \n\n \n\nPVC Fills\n\n \n\n \n\nWater Cooled Scroll Chillers\n\n \n\n \n\nCold Rooms\n\n \n\n \n\n \n\nAir Receivers\n\n \n\n \n\nForced Draft Cooling Tower\n\n \n\n \n\nOil Chillers\n\n \n\n \n\nAdsorption Dryers ( Heatless)"
  },
  "ammonia-milk-chillers": {
    "title": "Ammonia Milk Chillers",
    "description": "",
    "content": "Ammonia Milk Chillers\n\n The DRYCOOL series have been realized to offer to the users all the advantages of a long lasting investment as well as the use of an environmental friendly fluid. The use of ammonia, will maximize the performance of the machines with an overall benefit on the running costs the users have to bear. Ammonia represents one of the possible ways to reduce the environmental impact of the cooling sector (GWP = 0 and ODP = 0).\n\nThe engineering of the DRYCOOL ammonia chillers has been particularly detailed, to offer to the customers the widest possibility of choice. All the range is available in several set-up according to the single specifications of the project or customers’ needs.\n\nProduct’s range includes machines with 1, 2, or 3 screw compressors in parallel.\n\nIt is possible to supply packaged chillers with low refrigerant charge (up to 75 kg, as for Italian rules).\n\nSeveral and different configurations, which also include: PHE/S&T/S&P heat exchangers.\n\nDirect Expansion (DX) units or Flooded (FL) system units.\n\nThe control is made by an electronic standard or by a PLC. The chillers can be supplied with or without electrical board.\n\nThe DRYCOOL series can be realized for out/indoor installations.\n\nThe DRYCOOL Chillers can be designed for both the cooling of the water as such, or the cooling – at negative temperatures – of brine solutions, whether they are based on glycols or salt solutions.\n\nThe units are made by a self supporting painted steel frame welded with pressbent metal sheet profiles. All the components of the steel frame are epoxy powder coated.\n\n \n\n \n\n \n\n \n\nFeatures\n\n \nCustomized solution.\n\nLow maintenance cost.\n\ndurabilityEasy installation.\n\nPerfect cooling.\n\nPerformance oriented.\n\nEasy operations.\n\nFunctional efficiency.\n\nRugged construction.\n\n \n\n \n Related Portfolios \n\n \n\nAir Washer\n\n \n\n \n\nSquare Type Cooling Tower\n\n \n\n \n\nCold Room Doors\n\n \n\n \n\nRectangular Type Cooling Tower\n\n \n\n \n\n \n\nForced Draft Cooling Tower\n\n \n\n \n\nCold Rooms\n\n \n\n \n\nWater Cooled Scroll Chillers\n\n \n\n \n\nCold Room Panels\n\n \n\n \n\n \n\nShell & Tube Type Condenser\n\n \n\n \n\nAir Handling Unit\n\n \n\n \n\nWater Cooled Scroll Chillers ( Single Compressor)\n\n \n\n \n\nAir Cooled Scroll Chillers"
  },
  "ball-valve": {
    "title": "Ball valve",
    "description": "",
    "content": "Ball valve\n\n we supply ball value\n\n \n\n \n\n \n\n \n\nFeatures\n\n \nHigh performance.\n\nSturdy construction.\n\nLonger service life."
  },
  "bottle-type-cooling-tower": {
    "title": "Bottle Type Cooling Tower",
    "description": "",
    "content": "Bottle Type Cooling Tower\n\n Our Bottle Type cooling towers are of induced draft design, which is why these are more efficient than forced draft counter flow design. Using less power per cooling ton, our towers represent the latest development in the use of plastic technology. Using superior quality FRP materials in fabrication, we offer towers which have resistant to damages and also prevent corrosive effect of weather and chemicals. Our induced draft design consumes 50% less energy and it can easily cut city water and sewer bills by up to 97%, as water is re-circulated instead of being wasted. One can rely on our towers because our cooling tower provide dependable, trouble-free and satisfactory long-term service. Our cooling towers in fiber glass reinforced plastics provide economic outdoor dissipation of heat picked up by water in air conditioning & refrigeration, co\n\n \n\n \n\n \n\n \n\nTechnical Parameters\n\n Technical Parameters For Drycool Bottle Type Cooling Tower.\n\nMODEL\nCAPACITY\n\n TR\nHEAT\n\n Rejection\n\n Kcal/Hrx\n\n 1000\nOVER ALL\n\n DIMENSIONS\nFAN\n\n DIA\n\n (mm)\nMOTOR\n\n HP\nOPERATING\n\n WEIGHT\n\n Kg.\nPUMP\n\n HEAD\n\n mm WC\n\nHeight\n\n (mm)\nDiameter (mm)\n\nDC-FRP-01\n7.5\n28\n2000\n900\n600\n½\n210\n1800\n\nDC-FRP-02\n15\n56\n2000\n1100\n700\n1\n350\n2000\n\nDC-FRP-03\n25\n98\n2300\n1900\n900\n2\n520\n2500\n\nDC-FRP-04\n30\n115\n2300\n1900\n900\n2\n600\n2500\n\nDC-FRP-05\n40\n160\n2900\n2200\n1200\n2\n800\n3000\n\nDC-FRP-06\n50\n190\n2900\n2200\n1200\n2\n900\n3000\n\nDC-FRP-07\n60\n225\n2900\n2200\n1200\n3\n1200\n3000\n\nDC-FRP-08\n80\n320\n3100\n2900\n1450\n3\n1500\n3000\n\nDCB-FRP-09\n100\n380\n3100\n2900\n1450\n5\n1650\n3200\n\nDC-FRP-10\n125\n470\n3100\n3250\n1500\n5\n1850\n3200\n\nDC-FRP-11\n150\n568\n3100\n3250\n1500\n7.5\n1950\n3400\n\nDC-FRP-12\n175\n658\n3300\n3400\n1800\n7.5\n2200\n3400\n\nDC-FRP-13\n200\n755\n3300\n3400\n1800\n10\n2300\n3500\n\nDC-FRP-14\n250\n940\n3600\n3800\n1800\n10\n3400\n3800\n\nDC-FRP-15\n300\n1128\n3600\n3800\n1800\n10\n3700\n3800\n\nDC-FRP-16\n400\n1550\n3800\n4200\n3000\n15\n6000\n4200\n\nDC-FRP-17\n500\n1890\n4100\n6000\n3000\n15\n6500\n4500\n\n \n\n \n Related Portfolios \n\n \n\nAir Cooled Scroll Chillers\n\n \n\n \n\nForced Draft Cooling Tower\n\n \n\n \n\nWater Cooled Scroll Chillers\n\n \n\n \n\nPlate Heat Exchanger\n\n \n\n \n\n \n\nFilters\n\n \n\n \n\nAir Washer\n\n \n\n \n\nCold Room Doors\n\n \n\n \n\nWater Cooled Screw Chillers (Single Compressor)\n\n \n\n \n\n \n\nRotary Sprinkler\n\n \n\n \n\nOil Chillers\n\n \n\n \n\nRectangular Type Cooling Tower\n\n \n\n \n\nAftercoolers"
  },
  "brine-chillers": {
    "title": "Brine Chillers",
    "description": "",
    "content": "BRINE CHILLERS \n\n CHOICE OF SCREW COMPRESSOR of Hanbell (Taiwan), Bitzer (Germany) & J&E Hall (UK). All options are semi-hermetic in construction, thereby making it maintenance friendly. The screw compressor range offered is specifically developed for low temperature chillers applications and is offered along with adjustable volume ratio. Besides internally built oil separation system, check valves at suction and discharge port are provided as standard part of the OEM equipment. The screw compressor range offered is specifically designed by the respective OEMs for low temperature applications. \n\nHIGH COP/EER \n\nHigh cop/eer as an issue proficient gathering of the refrigerant. These water cooled chiller units are intended to meet the relevant necessities of ASHRAE/ANSI 15 Safety Code. Since the condensers are liberally oversized, productive gathering of the refrigerant prompts lower IKW contrasted and other accessible brands.\n\nSHELL & TUBE EVAPORATOR \n\nShell & tube evaporator is constructed with copper containers of 19 SWG that empowers them to withstand hard water with PH more noteworthy than 8. The copper tubes contain Flamingo licensed star turbulator embeds that give turbulence to the refrigerant coursing through the copper tubes. As an issue of this turbulence these Shell & Tube evaporators have amazingly effective hotness exchange rate. The shell is produced from high-review steel. The evaporator is planned according to ASME Section VIII Div.1.\n\nAVAILABLE IN A CHOICE OF REFRIGERANTS \n\nAvailable in a choice of refrigerants R-22 (Freon), R-407c and R-134a. Both R-407c and R-134a are environment neighborly and non-ozone draining refrigerants.\n\nULTRA EFFICIENT CONDENSING \n\nUltra efficient condensing using outer finned copper tubes for increasing heat transfer surface results in higher efficiencyin comparison to copper tubes without finning. The copper tubes are of 16 SWG and are finned on the outer surface to accommodate up to 26 fins per inch. The copper tubes are mechanically expanded through a torque controlled machine on the tube sheets that are manufactured on imported VMC machine. \n\nECONOMIZER FOR HIGHER EFFICIENCY \n\nEconomizer for higher efficiency is provided as per refrigerant used and depending upon the liquid temperature range desired. Economiser is provided as standard part of supply in process chillers opted for evaporating temperature of 0 deg. C or lower. The economizer/sub-cooler enhances the overall capacity of the chiller by 10%, and reduces the power consumption, thereby increasing the overall Coefficient of Performance (COP).\n\nAVAILABLE IN A CHOICE OF REFRIGERANTS \n\nAvailable in a choice of refrigerants R-22 (Freon), R-407C and R-134a. Both R-407C and R-134A are environment friendly and non-ozone depleting refrigerants.\n\n \n\n \n\nADDITONAL AIR COOLED TYPE OIL COOLER \n\nAdditonal air cooled type oil cooler is added depending upon the refrigerant used and the chilled water/brine temperature desired. The oil cooler helps maintain the oil temperatures flowing through the compressor within safe limits. The oil cooler fan is automatically controlled depending upon the oil temperature. This feature enhances the screw compressor life. \n\nLIQUID INJECTION \n\nLiquid injection is a standard gimmick and is utilized to cool the compressor engine slowing down. When the release temperature surpasses the ordinary range, an electric solenoid curl infuses fluid refrigerant to keep the slowing down inside protected breaking points. This peculiarity upgrades the life of the screw compressor.\n\nTHERMOSTATIC EXPANSION VALVE \n\nThermostatic expansion valve is given as an issue some piece of the water cooled screw chiller gear. Electronic extension valve can likewise be alternatively given.\n\nCONTROL PANEL \n\nControl panel with IP-65 assurance is given as standard piece of the water cooled supplies.\n\nMICROPROCESSOR BASED CONTROLLER \n\nMicroprocessor based controller is a standard piece of the water cooled screw chiller supplies. The controller permits various set focuses that can be arranged to specific set of values that may be considered inside the safe working extent. If there should be an occurrence of any rupture in any of the set point esteem the controller will excursion the chiller after the fed wellbeing postponement period has passed and show it on the LCD show. Additionally, the controller naturally conforms the limit in a stepped configuration making them perfect for variable burden applications.\n\n \n\n \n\n \n Related Portfolios \n\n \n\nAir Cooled Scroll Chillers\n\n \n\n \n\nAir Cooled Screw Chillers\n\n \n\n \n\nForced Draft Cooling Tower\n\n \n\n \n\nPVC Fills\n\n \n\n \n\n \n\nCold Room Doors\n\n \n\n \n\nAir Washer\n\n \n\n \n\nAir Receivers\n\n \n\n \n\nAir Cooled Screw Chillers (Single Compressor)\n\n \n\n \n\n \n\nBottle Type Cooling Tower\n\n \n\n \n\nFlange Motor\n\n \n\n \n\nPlate Heat Exchanger\n\n \n\n \n\nSquare Type Cooling Tower"
  },
  "cold-room-doors": {
    "title": "Cold Room Doors",
    "description": "",
    "content": "Cold Room Doors\n\n \nEach cold room/freezer room is equipped with one (1) semi-rebated hinged door complete with heavy duty hinges and lockable door handle, fitted with a luminous emergency entrapment release, which will override the locking mechanism. Door gaskets will be of a pullout push-in type for easy field replacement.\n\nDoor surround and threshold are in stainless steel Grade 304. For freezer application the door surround will be fitted with heater to keep door free at low temperatures. Two standard sizes relating to room width is supplied the larger giving a clear opening of 700 X 1840mm. The smaller 545 X 1840mm.\n\nThe door blade is of the same finish as the room panels supplied. Door sweeper gaskets are supplied for floorless room applications.\n\n \n\n \n\n \n\n \n\n \n Related Portfolios \n\n \n\nWater Cooled Screw Chiller\n\n \n\n \n\nAmmonia Milk Chillers\n\n \n\n \n\nAdsorption Dryers ( Heatless)\n\n \n\n \n\nAir Cooled Screw Chillers\n\n \n\n \n\n \n\nRotary Sprinkler\n\n \n\n \n\nAir Cooled Scroll Chillers (Single Compressor)\n\n \n\n \n\nBottle Type Cooling Tower\n\n \n\n \n\nAir Handling Unit\n\n \n\n \n\n \n\nShell & Tube Type Condenser\n\n \n\n \n\nCold Room Panels\n\n \n\n \n\nWater Cooled Scroll Chillers ( Single Compressor)\n\n \n\n \n\nWater Cooled Screw Chillers (Single Compressor)"
  },
  "cold-room-panels": {
    "title": "Cold Room Panels",
    "description": "",
    "content": "Cold Room Panels\n\n Category: Stainless steel panels, Aluminium boards, Color steel plate, Poder coating steel plate.\n\nSpecification: 60, 70, 100, 120, 150, 180mm.\n\nStandard Width of cold room plates: 960mm, Length: 2000mm~1200mm.\n\nWe can meet all your special requirements for cold room.\n\nPerformance Data: Length ≤6 Meters.\n\nThermal conduction: 0.019Kal/m”C.\n\nAve. Density: 35-55kg/m3.\n\nPressive strength≥0.2MPa.\n\nMax. Operation Temp.: 90”C.\n\nLowest operation Temp: -120”C. \n\n \n\n \n\n \n\n \nGeneral.\n\nWalk-in cold room and freezer rooms are constructed of prefabricated insulated panels to allow convenient and accurate field assembly and future enlargement by the addition of further panels. Panel sizes allows entry to proposed area without cutting or adjustment where possible.\n\nConstruction of wall, ceiling and floor panels are such to meet International Hygiene Food Hygiene Standards.\n\nPanels are fire resistant Class 1.\n\nThe Refrigeration equipment are ‘ISO’ approved and appliance tested at point of construction or after installation.\n\n \n Related Portfolios \n\n \n\nRotary Sprinkler\n\n \n\n \n\nAir Handling Unit\n\n \n\n \n\nAir Cooled Screw Chillers (Single Compressor)\n\n \n\n \n\nWater Cooled Screw Chillers (Single Compressor)\n\n \n\n \n\n \n\nFlange Motor\n\n \n\n \n\nRectangular Type Cooling Tower\n\n \n\n \n\nSquare Type Cooling Tower\n\n \n\n \n\nBottle Type Cooling Tower\n\n \n\n \n\n \n\nAftercoolers\n\n \n\n \n\nCold Room Refrigeration Equipments\n\n \n\n \n\nShell & Tube Type Evaporator\n\n \n\n \n\nAir Cooled Screw Chillers"
  },
  "cold-room-refrigeration-equipments": {
    "title": "Cold Room Refrigeration Equipments",
    "description": "",
    "content": "Cold Room Refrigeration Equipments\n\n \n\n \n\n \n\n \n\n \n\nWhere applicable and where there is sufficient ventilation, the room is fitted with an on-board air cooled refrigeration system capable of hold foodstuffs at the required temperature i.e. Chilled foods: +2 to +10C (Adjustable), Fresh meats: -2 to +5°C (adjustable), Frozen foods: -18 to –2°C. The unit is manufactured to take up the full length of a panel and take condenser air from the coolest area i.e. Bottom of unit. The condenser is fitted with a filter, which is removed for easy cleaning. The unit is selected to operate in ambient temperatures up to +3°C and optional tropical version if required.\n\nA control panel is incorporated to include a digital temperature display that is easily adjusted to the required temperature instrument also have a high/low temperature alarm pre-set to be both audible and visual should the room temperature go beyond pre-set limits. The refrigeration system is environmentally friendly refrigerants. This unit is supplied with bulkhead light and light on/off switch. The freezer model is fitted with a pressure equalizing valve. To reduce operating costs the unit will defrost using a reverse cycle hot gas system.\n\nWhere there is insufficient ventilation a heat disposal system is offered. This will take condenser heat by a means of a water heat transfer system to an outside or cooler area. The condenser section is simple to install and low in noise, so as not to create a nuisance or attract complaints via environmental health officers. The unit has a rating of no more than 40 DBA at 1 meter. The interconnecting pipe work is of non-kink neoprene hose and the system filled with a water glycol solution. All other components remain as air cooled version.\n\n \n\n \n\n \n\n \n Related Portfolios \n\n \n\nWater Cooled Scroll Chillers ( Single Compressor)\n\n \n\n \n\nBrine Chillers\n\n \n\n \n\nPlate Heat Exchanger\n\n \n\n \n\nSquare Type Cooling Tower\n\n \n\n \n\n \n\nForced Draft Cooling Tower\n\n \n\n \n\nAdsorption Dryers ( Heatless)\n\n \n\n \n\nWater Cooled Screw Chiller\n\n \n\n \n\nAir Receivers\n\n \n\n \n\n \n\nIndustrial Chillers\n\n \n\n \n\nAir Washer\n\n \n\n \n\nOil Chillers\n\n \n\n \n\nCold Rooms"
  },
  "cold-rooms": {
    "title": "Cold Rooms",
    "description": "",
    "content": "Cold Rooms\n\n \n\n \n\n \n\n \n\n \n\nOur cold rooms are designed for special applications and special temperature control.\n\nThe user-friendly structure is a CFC-free refrigeration system, which facilitates efficient cooling, freezing of the chamber.\n\nThese cold storages are widely used by Food Processing and Pharmaceutical industry, Fisheries, Hotels and Research & Development companies.\n\n \n\n \n\n \n\nTemperature Range\n\nDoor\n\nFloor Type\n\nInsulation material\n\nFeatures\n\nApplications\n\n \nChiller 2 to 8 deg C.\n\nfreezer -18 to -30 deg C.\n\n \n \nFlush type.\n\nOverlap type.\n\nSliding type.\n\n \n \nPanel with AL ch. sheet.\n\nPuff slabs with Kota stone.\n\n \n \nPuff (highly heat resistant material).\n\n \n \nWide temperature range and capacity.\n\nPre-fabricated panels for easy assembly, cam lock in tongue and groove assembly.\n\nFood safe and CFC free.\n\nMicro-processor based electronic control panel board, digital temperature indicator.\n\nEnergy efficient refrigeration systems attuned to suit high ambient conditions.\n\n \n \nHotels & Restaurants.\n\nIce Cream Industry for Hardening & Storage.\n\nPrimary Processing & Food Processing Plant.\n\nIncubation Chamber & Dairy Products Storage.\n\nAir-Conditioned Ware House.\n\nHospitals & Labs.\n\nPharmaceutical Industry.\n\nFloriculture.\n\nHorticulture.\n\nSuper markets & Convenience Store.\n\nPre-Cooling Chambers.\n\nBlast Freezer for Poultry Processing.\n\n \n\n \n Related Portfolios \n\n \n\nWater Cooled Screw Chillers (Single Compressor)\n\n \n\n \n\nPVC Fills\n\n \n\n \n\nAir Cooled Screw Chillers\n\n \n\n \n\nAmmonia Milk Chillers\n\n \n\n \n\n \n\nAir Cooled Scroll Chillers (Single Compressor)\n\n \n\n \n\nRefrigerated Air Dryers\n\n \n\n \n\nSprinkler Fan\n\n \n\n \n\nAir Receivers\n\n \n\n \n\n \n\nForced Draft Cooling Tower\n\n \n\n \n\nFilters\n\n \n\n \n\nCold Room Refrigeration Equipments\n\n \n\n \n\nFlange Motor"
  },
  "expansion-valve": {
    "title": "Expansion Valve",
    "description": "",
    "content": "Expansion Valve Card\n\n We Supply Expansion Valve Card\n\n \n\n \n\n \n\n \n\nFeatures\n\n \nHigh performance.\n\nSturdy construction.\n\nLonger service life."
  },
  "filters": {
    "title": "Filters",
    "description": "",
    "content": "Filters\n\n Drycool is a world class producer of air filtration products. With a wide variety of product offerings, air filters provide superior air quality to almost every compressed air application in the industry.\n\nF-Series advanced compressed air filters are rigorously tested and engineered with superior components to provide years of reliable performance for high quality air.\n\n \n\n \n\n \n\n \n\n \n Related Portfolios \n\n \n\nBrine Chillers\n\n \n\n \n\nAmmonia Milk Chillers\n\n \n\n \n\nAir Cooled Screw Chillers\n\n \n\n \n\nAir Cooled Screw Chillers (Single Compressor)\n\n \n\n \n\n \n\nForced Draft Cooling Tower\n\n \n\n \n\nSprinkler Fan\n\n \n\n \n\nSquare Type Cooling Tower\n\n \n\n \n\nWater Cooled Screw Chillers (Single Compressor)\n\n \n\n \n\n \n\nIndustrial Chillers\n\n \n\n \n\nAir Handling Unit\n\n \n\n \n\nCold Room Doors\n\n \n\n \n\nBottle Type Cooling Tower"
  },
  "flange-motor": {
    "title": "Flange Motor",
    "description": "",
    "content": "Flange Motor\n\n With our rich industry experience and knowledge, we are engaged in offering high quality Flange Motor. Precisely designed and manufactured by knowledgeable professionals using quality accepted components and latest techniques in conformity with industry standards, we offer this motor in different stipulation and can also be custom designed as per the precise needs of clients. Also, offered motor is meticulously tested on different quality parameters to ensure its high problem free performance at client end. Special low RPM totally enclosed motors of vertical, flange type with enlarged and threaded shaft and sealed top supplied with the cooling tower, the motor is totally weather proof in IP 55 construction suitable for heated and humid atmosphere.\n\n \n\n \n\n \n\n \n\nFeatures\n\n \nHigh quality.\n\nLow maintenance.\n\nDurability.\n\n \n\n \n Related Portfolios \n\n \n\nAir Washer\n\n \n\n \n\nCold Room Doors\n\n \n\n \n\nAir Handling Unit\n\n \n\n \n\nPlate Heat Exchanger\n\n \n\n \n\n \n\nAir Cooled Scroll Chillers\n\n \n\n \n\nForced Draft Cooling Tower\n\n \n\n \n\nWater Cooled Scroll Chillers ( Single Compressor)\n\n \n\n \n\nAdsorption Dryers ( Heatless)\n\n \n\n \n\n \n\nRectangular Type Cooling Tower\n\n \n\n \n\nShell & Tube Type Condenser\n\n \n\n \n\nBottle Type Cooling Tower\n\n \n\n \n\nWater Cooled Scroll Chillers"
  },
  "forced-draft-cooling-tower": {
    "title": "Forced Draft Cooling Tower",
    "description": "",
    "content": "Forced Draft Cooling Tower\n\n Forced draft — A mechanical draft tower with a blower type fan at the intake. The fan forces air into the tower, creating high entering and low exiting air velocities. The low exiting velocity is much more susceptible to recirculation. With the fan on the air intake, the fan is more susceptible to complications due to freezing conditions. Another disadvantage is that a forced draft design typically requires more motor horsepower than an equivalent induced draft design. The benefit of the forced draft design is its ability to work with high static pressure. Such setups can be installed in more-confined spaces and even in some indoor situations. \n\n \n\n \n\n \n\n \n\n \n Related Portfolios \n\n \n\nBottle Type Cooling Tower\n\n \n\n \n\nCold Rooms\n\n \n\n \n\nAir Receivers\n\n \n\n \n\nPVC Fills\n\n \n\n \n\n \n\nAdsorption Dryers ( Heatless)\n\n \n\n \n\nBrine Chillers\n\n \n\n \n\nShell & Tube Type Evaporator\n\n \n\n \n\nAir Cooled Screw Chillers\n\n \n\n \n\n \n\nAmmonia Milk Chillers\n\n \n\n \n\nFlange Motor\n\n \n\n \n\nAir Cooled Scroll Chillers (Single Compressor)\n\n \n\n \n\nRectangular Type Cooling Tower"
  },
  "high-pressure-gauge": {
    "title": "High Pressure Gauge",
    "description": "",
    "content": "High Pressure Gauge\n\n We Supply High Pressure Gauge.\n\n \n\n \n\n \n\n \n\nFeatures\n\n \nHigh performance.\n\nSturdy construction.\n\nLonger service life."
  },
  "high-pressure-switch": {
    "title": "High Pressure Switch",
    "description": "",
    "content": "High Pressure Switch\n\n We Supply High Pressure Switch\n\n \n\n \n\n \n\n \n\nFeatures\n\n \nHigh performance.\n\nSturdy construction.\n\nLonger service life."
  },
  "industrial-chillers": {
    "title": "Industrial Chillers",
    "description": "We make industrial chillers like Screw chillers, Scroll Chillers, Water cooled chillers, air cooled chillers, inverter chillers, Brine chiller",
    "content": "Industrial Chillers:\n\nWe make industrial chillers like Air cooled screw chillers, Water cooled screw chillers, Air cooled scroll chillers, water cooled scroll chillers, Air cooled scroll chillers, water cooled scroll chillers, ammonia milk chillers, Brine chillers, Batching Plant chillers.\n\nAll Products \n\nContact us\n\nAbout Industrial chillers:\n\nIndustrial chillers are the best reproduction system that is used for cooling process dehumidifier air or fluid in industrial and commercial facilities. It will use absorption cycle for vapor compressor to cool the environment. Even the chilled water variation is also used for space cooling to various process uses. Drycool Systems is one of the renowned chiller manufacturers which will ensure you with advanced equipment for the application.\n\nThe condenser serves as a two-fold component, and once the condensation occurs the high-pressure vapor needs to be saturated condition to complete the cooling process. It will help in removing the heat from the processing load by using absorption or vapor compression. The process is mainly for transferring the heat from one place to another. Various industries are involved in the usage of the these chillers to cool down machines to have more efficient production.\n\nYou are the most common uses of industrial chillers are anodizing where it needs to be cooling-off to function properly. Most of the plastic industries and also use these chillers to school hot plastics during the manufacturing process. It will rapidly cool down the machinery which is being used for manufacturing plastic products. This will help in saving energy and increase the life of the machine. these chillers are also useful in the printing industry as they remove the heat which is been generated by the friction of the plastic rollers during the printing. \n\nIt will also help in cooling down the paper once it comes out of the ink of the drying machine. Even the rubber industry is also involved in these chillers as it is needed for properly maintaining water temperature and even the cooling of rubber mixtures along with rubber mills. It is also being used by power supplies in the laser and light which is mainly involved in the production industry. The beverage industries also have advantages in using the these chillers it helps in proper maintenance of mixing, cooking, and pasteurizing process it generates a lot of heat.\n\nProminent Features of Drycool System’s Industrial Chiller:\n\nEquipped with environment-friendly refrigerants R-134A, R-407C, and R-410A.\n\nIt is completely energy-efficient and reliable and equipped with a scroll compressor of European origin.\n\nIt is equipped with an individual and separate refrigeration circuit with every compressor.\n\nThe electronic expansion valve is for large capacities, precise temperature control, and energy efficiency.\n\nHigh energy efficiency.\n\nAlso get high condensing and low FPI count, which will offer the high flow, low noise, and pressure-controlled axial fans. This will ensure high energy efficiency and even it can be operable with various harsh ambient conditions.\n\nSolution energy-saving equipment.\n\nSuperior reliability.\n\nA fully automatic PLC-based unit is added for data login and remote operation facilities.\n\nLong equipment life.\n\nAdaptive frequency drive option available.\n\nClean energy and intelligent management.\n\nHighly durable design with the best class cop.\n\nEfficient lubrication even during the power failure.\n\nEasy interface with BMS through protocols.\n\nOzone friendly refrigerant HFC407c & HFC134a.\n\nThe complete body is made out of galvanized steel.\n\nPolyurethane paint and powder coated.\n\nIt is having single and multiple skid-mounted units of refrigeration circuits which also includes an Industrial pump and bypass mechanism.\n\nFactory manufacture and tested tube in tube system along with shell and tube evaporators. It will offer a high flow high-pressure design along with various specific process applications. It is specially designed for handling Industrials properly.\n\nGet a fully automatic PLC-based unit that will offer data logging facilities and remote operation.\n\nIt is having high condensing areas and low if count which will increase the high flow and low noise with pressure control axial fans. It will offer the best energy efficiency while operating in Harsh ambient conditions.\n\nHaving fully automatic and step capacity control with multiple compressor operations ranging from 33 % to 100%.\n\nIt is equipped with an advanced microprocessor-based controller.\n\nWorld-class safety controllers for compressors and equipment.\n\nWater flow switches and antifreeze safety.\n\nCompletely functionally tested.\n\nCustom-built machine inquiries are also being entertained due to specific requirements of the client.\n\nSite support along with AMC options for the entire life of the equipment.\n\nGet extended warranty options which are available for up to 10 years.\n\nAdvantages of Drycool System’s Industrial Chiller:\n\nGet complete control for maintaining a precise temperature.\n\nEquipped with a wide operating range for temperature.\n\nGet constant outlet temperature depending on the varying ambient condition.\n\nMinimum maintenance required.\n\nIt is most highly recommended for fluctuating loads along with eco-friendly functionalities.\n\nGet contamination-free functionality due to closed loop.\n\nMost suitable for both outdoor type and indoor type installation.\n\n \n Related Portfolios \n\n \n\nAir Cooled Screw Chillers\n\n \n\n \n\nFlange Motor\n\n \n\n \n\nWater Cooled Scroll Chillers\n\n \n\n \n\nWater Cooled Screw Chillers (Single Compressor)\n\n \n\n \n\n \n\nAir Cooled Scroll Chillers\n\n \n\n \n\nWater Cooled Screw Chiller\n\n \n\n \n\nOil Chillers\n\n \n\n \n\nBrine Chillers\n\n \n\n \n\n \n\nCold Room Doors\n\n \n\n \n\nPlate Heat Exchanger\n\n \n\n \n\nAir Washer\n\n \n\n \n\nShell & Tube Type Condenser"
  },
  "low-pressure-switch": {
    "title": "Low Pressure Switch",
    "description": "",
    "content": "Low Pressure Switch\n\n Owing to our years of industry experience, we are engaged in providing our clients a wide range of high quality PVC Fill. Offered product is widely used in various places as per their precise needs of applications. Manufactured by skilful professionals using finest quality raw materials and most recent technology in order to meet the set industry quality standards, we offer this product at the most affordable rate to the clients. Honeycomb type PVC fills are used for extended contact area having a high heat transfer efficiency. The crossing of air and water stream in close proximity. Which creates a diffused turbulence conducive to evaporation and efficient heat transfer, all PVC fills are double folded with an automatic drainage system, producing a favorable pressure drop and a good protection against erosion. They are glued by automatic process and manufactured with German design ensuring a maximum drift of 0.001% under standard design conditions. The sub distribution pipes are made of rigid PVC with a testing pressure of 6 Kg/cm2.\n\n \n\n \n\n \n\n \n\nFeatures\n\n \nHigh performance.\n\nSturdy construction.\n\nLonger service life."
  },
  "non-return-valve": {
    "title": "Non return valve",
    "description": "",
    "content": "Non return valve\n\n We supply Non return valve, its also called NRV.\n\n \n\n \n\n \n\n \n\nFeatures\n\n \nHigh performance.\n\nSturdy construction.\n\nLonger service life."
  },
  "oil-chillers": {
    "title": "Oil Chillers",
    "description": "",
    "content": "Oil Chillers \n\n Our organization is manufacturing Oil Chillers, which is offered in various capacities such as from 6,000 K.Cal/hr. up to 60,000 K.Cal/hr. Our range can be used to cool the oil directly using refrigerant, up to a oil temperature of (+) 45°C without over heating the compressor. Specially designed with intrinsic with imported refrigerant to oil exchanger with sealed and scroll compressors depending on the size of the equipment, these are catering to the requirements of the industrial units, pharma and chemicals and pipe industry.\n\nThese chillers are rated for an ambient of (+) 50°C and various operating voltages which are:\n\n380 / 400 volt ac / 50 hz.\n\n460 volt AC / 50 hz.\n\n380 volt ac / 60 hz.\n\n460 volt ac / 60 hz.\n\n \n\n \n\n \n\n \n\n \n Related Portfolios \n\n \n\nPlate Heat Exchanger\n\n \n\n \n\nFilters\n\n \n\n \n\nSquare Type Cooling Tower\n\n \n\n \n\nIndustrial Chillers\n\n \n\n \n\n \n\nCold Room Panels\n\n \n\n \n\nRefrigerated Air Dryers\n\n \n\n \n\nBottle Type Cooling Tower\n\n \n\n \n\nRotary Sprinkler\n\n \n\n \n\n \n\nShell & Tube Type Condenser\n\n \n\n \n\nCold Room Refrigeration Equipments\n\n \n\n \n\nAir Cooled Screw Chillers (Single Compressor)\n\n \n\n \n\nAir Washer"
  },
  "oil-separator": {
    "title": "Oil Separator",
    "description": "",
    "content": "Oil Separator\n\n We Provide Oil Separator\n\n \n\n \n\n \n\n \n\nFeatures\n\n \nHigh performance.\n\nSturdy construction.\n\nLonger service life."
  },
  "plate-heat-exchanger": {
    "title": "Plate Heat Exchanger",
    "description": "",
    "content": "Plate Heat Exchanger\n\n We are an eminent entity engaged in offering an extensive range of Plate Heat Exchanger. The offered exchanger is precisely manufactured by our skilled professionals following high definition engineering principles and utilizing premium quality components. This exchanger is tested properly against numerous parameters in order to deliver defect free range. Client can purchase the offered exchanger from us at economical prices.\n\n \n\n \n\n \n\n \n\nFeatures\n\n \nSturdy construction.\n\nHigh functionality.\n\n \n\n \n Related Portfolios \n\n \n\nBottle Type Cooling Tower\n\n \n\n \n\nForced Draft Cooling Tower\n\n \n\n \n\nBrine Chillers\n\n \n\n \n\nIndustrial Chillers\n\n \n\n \n\n \n\nFlange Motor\n\n \n\n \n\nWater Cooled Scroll Chillers ( Single Compressor)\n\n \n\n \n\nFilters\n\n \n\n \n\nShell & Tube Type Condenser\n\n \n\n \n\n \n\nAir Receivers\n\n \n\n \n\nAmmonia Milk Chillers\n\n \n\n \n\nAir Cooled Scroll Chillers (Single Compressor)\n\n \n\n \n\nRotary Sprinkler"
  },
  "pvc-fills": {
    "title": "PVC Fills",
    "description": "",
    "content": "PVC Fills\n\n Owing to our years of industry experience, we are engaged in providing our clients a wide range of high quality PVC Fill. Offered product is widely used in various places as per their precise needs of applications. Manufactured by skilful professionals using finest quality raw materials and most recent technology in order to meet the set industry quality standards, we offer this product at the most affordable rate to the clients. Honeycomb type PVC fills are used for extended contact area having a high heat transfer efficiency. The crossing of air and water stream in close proximity. Which creates a diffused turbulence conducive to evaporation and efficient heat transfer, all PVC fills are double folded with an automatic drainage system, producing a favorable pressure drop and a good protection against erosion. They are glued by automatic process and manufactured with German design ensuring a maximum drift of 0.001% under standard design conditions. The sub distribution pipes are made of rigid PVC with a testing pressure of 6 Kg/cm2.\n\n \n\n \n\n \n\n \n\nFeatures\n\n \nHigh performance.\n\nSturdy construction.\n\nLonger service life.\n\n \n\n \n Related Portfolios \n\n \n\nAdsorption Dryers ( Heatless)\n\n \n\n \n\nSprinkler Fan\n\n \n\n \n\nRotary Sprinkler\n\n \n\n \n\nCold Rooms\n\n \n\n \n\n \n\nOil Chillers\n\n \n\n \n\nWater Cooled Screw Chillers (Single Compressor)\n\n \n\n \n\nAir Cooled Scroll Chillers (Single Compressor)\n\n \n\n \n\nAir Washer\n\n \n\n \n\n \n\nWater Cooled Screw Chiller\n\n \n\n \n\nCold Room Doors\n\n \n\n \n\nCold Room Refrigeration Equipments\n\n \n\n \n\nRefrigerated Air Dryers"
  },
  "rectangular-type-cooling-tower": {
    "title": "Rectangular Type Cooling Tower",
    "description": "",
    "content": "Rectungelar Type Cooling Tower\n\n Backed by rich industry experience, we are offering an extensive range of Rectangular Type Cooling Tower. Precisely manufactured by our adroit professionals using premium quality raw material and most recent technology, this cooling tower is available in different technical specifications as per the precise requirements of clients. Also, offered cooling tower is tested on numerous quality parameters to ensure its flawless finish.\n\n \n\n \n\n \n\n \n\nFeatures\n\n \nDimensional accuracy.\n\nEnhanced durability.\n\nCorrosion resistance.\n\n \n\n \n Related Portfolios \n\n \n\nWater Cooled Scroll Chillers ( Single Compressor)\n\n \n\n \n\nAir Handling Unit\n\n \n\n \n\nShell & Tube Type Evaporator\n\n \n\n \n\nRefrigerated Air Dryers\n\n \n\n \n\n \n\nWater Cooled Scroll Chillers\n\n \n\n \n\nCold Rooms\n\n \n\n \n\nWater Cooled Screw Chillers (Single Compressor)\n\n \n\n \n\nAir Cooled Screw Chillers (Single Compressor)\n\n \n\n \n\n \n\nAir Cooled Scroll Chillers (Single Compressor)\n\n \n\n \n\nAir Receivers\n\n \n\n \n\nFlange Motor\n\n \n\n \n\nCold Room Doors"
  },
  "refrigerated-air-dryers": {
    "title": "Refrigerated Air Dryers",
    "description": "",
    "content": "Refrigerated Air Dryers\n\n \n\n \n\n \n\n \n\n \nCompressed air with saturated water vapor enters the dryer’s pre-cooling device, in which, the entered hot air is cooled down by the outgoing cold air partly, thus reducing the load on the system (this process is pre-cooling). Pre-cooled air enters the evaporator. Here, heat released by the air is absorbed by media and the air reaches the pre-set temperature (2 ~ 4℃). After being cooled, the water vapor in the air condenses into droplets and is separated from the air by steam separator and then flows out of the dryer through automatic drainer. Leaving the separator, cold air enters into the pre-cooling device’s shell side for heat exchange with hot air in the inlet and leaves the dryer after being heated to a temperature about 10 ℃ lower than that of the inlet air. This reheating prevents the second moisture condensation in the outside exit air pipeline and downstream pipeline, increases the energy of the air and improves the effectiveness. In addition, after passing through the dryer, solid dust of over 3μ in the compressed air is all filtered, and the air source quality reaches the clean and dry requirements. \n\nTechnical Parameters\n\nSalient Features\n\n \n\nMODEL\nCAPACITY\n\n CMH\nAPPROX\n\n DIMENSION\n\n L x B x H(mm)\nAIR\n\n CONNECTION\nMOTOR\n\n H.P.\n\nDR-1\n7\n700 x 500 x 500\n1/2” BSP\n1/6\n\nDR-2\n43\n700 x 500 x 500\n1/2” BSP\n1/3\n\nDR-5\n86\n900 x 600 x 800\n3/4” BSP\n5/8\n\nDR-7\n129\n900 x 600 x 800\n3/4” BSP\n1/5\n\nDR-10\n171\n900 x 600 x 1000\n1” BSP\n1\n\nDR-15\n257\n1000 x 600 x 1000\n3/2” BSP\n1.5\n\nDR-20\n342\n1200 x 700 x 1000\n2” BSP\n2\n\nDR-25\n428\n1300 x 800 x 1200\n2” BSP\n3\n\nDR-30\n415\n1300 x 800 x 1300\n2” BSP\n3\n\nDR-40\n685\n1400 x 800 x 1400\n2.5” BSP\n5\n\nDR-50\n857\n1500 x 1000 x 1500\n3” BSP\n5\n\nDR-65\n1114\n1500 x 1200 x 1500\n3” BSP\n7.5\n\nDR-75\n1285\n1500 x 1300 x 1500\n3” BSP\n7.5\n\nDR-85\n1457\n1700 x 1300 x 1600\n4” BSP\n7.5\n\nDR-100\n1714\n1800 x 1400 x 1800\n4” BSP\n10\n\nDR-120\n2057\n1800 x 1500 x 1800\n4” BSP\n10\n\nDR-150\n2571\n1900 x 1600 x 2000\n4” BSP\n15\n\nDR-180\n3085\n1900 x 1600 x 2000\n6” BSP\n15\n\nDR-200\n3485\n2100 x 1800 x 2000\n6” BSP\n20\n\nDR-250\n4285\n2200 x 1900 x 2000\n8” BSP\n25\n\nDR-300\n5142\n2400 x 2000 x 2000\n8” BSP\n30\n\n \n \nEconomical in power consumption in comparison with other type of dryers for equivalent dew point.\n\nInnovative Heat Exchanger ensure max. Heat transfer & low pressure drop.\n\nIn built safety devices for compressor, condenser etc.\n\nConsistent Dew point over wide range of flows.\n\nSimple design, easy access to all parts requiring almost no maintenance.\n\nModular skid mounted unit in robust industrial cabinet is prewired and piped. Inbuilt air, electrical & drain connection. The dryer is ready to start saving your money.\n\nHigh quality product due to stage wise inspection & testing before dispatch.\n\n \n\n \n Related Portfolios \n\n \n\nAmmonia Milk Chillers\n\n \n\n \n\nFilters\n\n \n\n \n\nShell & Tube Type Evaporator\n\n \n\n \n\nAir Cooled Scroll Chillers\n\n \n\n \n\n \n\nCold Room Panels\n\n \n\n \n\nWater Cooled Screw Chiller\n\n \n\n \n\nIndustrial Chillers\n\n \n\n \n\nAir Cooled Screw Chillers (Single Compressor)\n\n \n\n \n\n \n\nPlate Heat Exchanger\n\n \n\n \n\nWater Cooled Scroll Chillers\n\n \n\n \n\nBottle Type Cooling Tower\n\n \n\n \n\nAir Cooled Scroll Chillers (Single Compressor)"
  },
  "rotary-sprinkler": {
    "title": "Rotary Sprinkler",
    "description": "",
    "content": "Rotary Sprinkler\n\n We are a remarkable entity, engaged in offering a high quality range of Rotary Sprinkler. Designed and developed in observance with industry standards using ultimate quality raw material, this sprinkler is stringently tested on various quality parameters by our professionals to avoid any kind of production defects. We offer this sprinkler in diverse stipulation at industry leading rates to the clients. Drycool specially designed rotary sprinklers head is made of aluminum alloy to avoid corrosion, also fitted with sealed ball bearing to take care of thrust and radial loads. It rotates at 1- RPM by the reaction force from the circulating water that is discharged at low pressure out of holes along PVC/HDPE pipes screwed into a rotating head.\n\n \n\n \n\n \n\n \n\nFeatures\n\n \nExcellent performance.\n\nRugged construction.\n\nHigh quality.\n\n \n\n \n Related Portfolios \n\n \n\nAir Cooled Scroll Chillers (Single Compressor)\n\n \n\n \n\nFilters\n\n \n\n \n\nBottle Type Cooling Tower\n\n \n\n \n\nOil Chillers\n\n \n\n \n\n \n\nAdsorption Dryers ( Heatless)\n\n \n\n \n\nPlate Heat Exchanger\n\n \n\n \n\nSprinkler Fan\n\n \n\n \n\nRefrigerated Air Dryers\n\n \n\n \n\n \n\nAmmonia Milk Chillers\n\n \n\n \n\nAir Handling Unit\n\n \n\n \n\nRectangular Type Cooling Tower\n\n \n\n \n\nAir Cooled Screw Chillers"
  },
  "screw-compressor": {
    "title": "Screw Compressor",
    "description": "",
    "content": "screw compressor\n\n Screw compressors are used in refrigeration industries for high efficiency and reliability compared to the other types of compressors. We Provide screw chillers which is manufactured by Bitzer\n\n \n\n \n\n \n\n \n\nFeatures\n\n \nHigh performance.\n\n30 TR to 200 TR\n\nLonger service life."
  },
  "scroll-compressor": {
    "title": "Scroll Compressor",
    "description": "",
    "content": "Scroll Compressor\n\n We Supply Scroll Compressor\n\n \n\n \n\n \n\n \n\nFeatures\n\n \nHigh performance.\n\nSturdy construction.\n\nLonger service life."
  },
  "shell-tube-type-condenser": {
    "title": "Shell & Tube Type Condenser",
    "description": "",
    "content": "Shell & Tube Type Condenser\n\n Drycool with its exceptional thermal performance and fatigue resistance, the compact-sized DRYCOOL Shell & Tube heat exchanger opens up a whole new world of possibilities. Designed for use with liquids, gases and two-phase mixtures at pressures up to 100 bar (1450 psi), in both PED and ASME, and at temperatures up to 450°C (842°F), DRYCOOL Shell & Tube is suitable for a wide range of aggressive media. \n\nThe benefits of DRYCOOL Shell & Tube:\n\nRobust design and minimized maintenance ensure maximum uptime\n\nSuperior thermal performance means maximum heat recovery using minimal heating and/or cooling media, which cuts fuel consumption, energy costs and environmental impact\n\nSmall footprint and light weight minimize installation, operating and maintenance costs\n\nGasket-free construction means high security against leakage\n\nEasy to install and maintain due to multipass design\n\nCompact solution with a small footprint\n\nThe features of DRYCOOL Shell & Tube:\n\nPatented roller coaster plate pattern ensures exceptionally high thermal efficiency.\n\nUnique cut-wing plates allow for multi-pass design.\n\nFully welded design allows for high operating pressure and optimizes resistance to fatigue.\n\nRobust design and minimized maintenance ensure maximum uptime.\n\nDistribution pipes run through the plate pack, relieving stress on the pack itself.\n\n \n\n \n\n \n\n \n\n \n Related Portfolios \n\n \n\nAir Cooled Scroll Chillers\n\n \n\n \n\nIndustrial Chillers\n\n \n\n \n\nAir Cooled Screw Chillers\n\n \n\n \n\nCold Room Panels\n\n \n\n \n\n \n\nWater Cooled Scroll Chillers\n\n \n\n \n\nSquare Type Cooling Tower\n\n \n\n \n\nOil Chillers\n\n \n\n \n\nShell & Tube Type Evaporator\n\n \n\n \n\n \n\nPVC Fills\n\n \n\n \n\nFlange Motor\n\n \n\n \n\nAir Cooled Scroll Chillers (Single Compressor)\n\n \n\n \n\nWater Cooled Screw Chillers (Single Compressor)"
  },
  "shell-tube-type-evaporator": {
    "title": "Shell & Tube Type Evaporator",
    "description": "",
    "content": "Shell & Tube Type Evaporator \n\n The DRYCOOL DM model is a dry-expansion shell-and-tube evaporator developed for medium temperature refrigeration applications.The DM design is optimized for R407F and R134a refrigerants, but can also be utilized with R404A and R507.\n\n \n\n \n\n \n\n \n\nFeatures\n\n \nThe new design is optimized for R134a and R407F refrigerants in order to comply with future EU’s regulations which will phase out refrigerants, such as R404A and R507 in 2017 (GWP > 2500).\n\nVery good thermal performance is achieved thanks to a patented and dedicated distribution system and new baffles, which minimize the shell bypass.\n\nVery efficient single-pass, counter-current design provides the best possible performance. Moreover, exchange tubes with an inner grooved pattern maximize the heat transfer coefficient and limit the negative effects of pressure drop.\n\nNo safety margin is required for thermal sizing of the DM evaporator, which is generally recommended for other evaporators (Dryplus-3 and Dryplus-E) in DRYCOOL smarTube user guidelines.\n\n \n\n \n Related Portfolios \n\n \n\nBottle Type Cooling Tower\n\n \n\n \n\nAftercoolers\n\n \n\n \n\nSquare Type Cooling Tower\n\n \n\n \n\nPlate Heat Exchanger\n\n \n\n \n\n \n\nFlange Motor\n\n \n\n \n\nAdsorption Dryers ( Heatless)\n\n \n\n \n\nCold Room Doors\n\n \n\n \n\nIndustrial Chillers\n\n \n\n \n\n \n\nCold Room Refrigeration Equipments\n\n \n\n \n\nAir Cooled Scroll Chillers (Single Compressor)\n\n \n\n \n\nShell & Tube Type Condenser\n\n \n\n \n\nRotary Sprinkler"
  },
  "sprinkler-fan": {
    "title": "Sprinkler Fan",
    "description": "",
    "content": "Sprinkler Fan\n\n With our rich industry experience and knowledge, we are engaged in offering high quality Sprinkler Fan. Precisely manufactured by our experienced professionals using quality accepted raw material in conformity with industry standards, we offer this fan in various specifications as per the precise needs of clients. Also, this fan is checked on numerous quality parameters to ensure its durability and reliability. Fan is not aerodynamic design, axial flow type to achieve better efficiency. MK’s Fan is made of adjustable FRP/Aluminum alloy blades that ensure large airflow at low static pressure, thus fan blades can change fan power consumption.\n\n \n\n \n\n \n\n \n\nFeatures\n\n \nHigh strength.\n\nCorrosion resistance.\n\nSturdiness.\n\n \n\n \n Related Portfolios \n\n \n\nRefrigerated Air Dryers\n\n \n\n \n\nAir Cooled Screw Chillers (Single Compressor)\n\n \n\n \n\nAftercoolers\n\n \n\n \n\nWater Cooled Scroll Chillers\n\n \n\n \n\n \n\nAir Cooled Scroll Chillers\n\n \n\n \n\nShell & Tube Type Evaporator\n\n \n\n \n\nShell & Tube Type Condenser\n\n \n\n \n\nPVC Fills\n\n \n\n \n\n \n\nBottle Type Cooling Tower\n\n \n\n \n\nWater Cooled Screw Chiller\n\n \n\n \n\nFilters\n\n \n\n \n\nOil Chillers"
  },
  "square-type-cooling-tower": {
    "title": "Square Type Cooling Tower",
    "description": "",
    "content": "Square Type Cooling Tower\n\n Our company is engaged in manufacturing a qualitative range of FRP square type cooling towers.\n\n Which are offered to industry for process cooling . These are demanded by the users of process coolers, diesel engine, machine and air-conditioning plants.\n\n \n\n \n\n \n\n \n\nTechnical Parameters\n\nBenefits\n\nCapacity\n\n Technical Parameters For Drycool Square Type Cooling Tower.\n\nWe are offering following types of cooling towers.\n\nMODEL\nCAPACITY\n\n TR\nOVER ALL\n\n DIMENSIONS\nFAN\n\n DIA\n\n (mm)\nOPERATING\n\n WEIGHT\n\n Kg.\nPUMP\n\n HEAD\n\n (mm)\nMOTOR/RPM\n\n HP\n\nLength (mm)\nWidth\n\n (mm)\n\nHeight\n \n\n(mm)\n\nDCS-FRP-01\n7.5 TR\n600\n600\n1950\n450\n150\n1800\n0.5/960\n\nDCS-FRP-02\n10 TR\n750\n750\n2050\n450\n200\n1800\n1/960\n\nDCS-FRP-03\n15 TR\n900\n900\n2100\n700\n275\n2000\n1/960\n\nDCS-FRP-04\n20 TR\n1050\n1050\n2200\n750\n360\n2000\n2/1400\n\nDCS-FRP-05\n30 TR\n1200\n1200\n2300\n900\n650\n2400\n2/960\n\nDCS-FRP-06\n40 TR\n1200\n1200\n2300\n900\n650\n2400\n2/960\n\nDCS-FRP-07\n50 TR\n1500\n1500\n2550\n1200\n850\n2900\n2/960\n\nDCS-FRP-08\n50 TR\n1500\n1500\n2550\n1200\n850\n2900\n3/960\n\nDCS-FRP-09\n60 TR\n1800\n1800\n2600\n1350\n1000\n3100\n3/960\n\nDCS-FRP-10\n80 TR\n1800\n1800\n2600\n1350\n1200\n3100\n5/960\n\nDCS-FRP-11\n100 TR\n2100\n2100\n2650\n1450\n1600\n3300\n5/960\n\nDCS-FRP-12\n125 TR\n2400\n2400\n2650\n1500\n2050\n3300\n5/960\n\nDCS-FRP-13\n150 TR\n2400\n2400\n2650\n1500\n2150\n3300\n7.5/960\n\nDCS-FRP-14\n175 TR\n2700\n2700\n2850\n1500\n2300\n3400\n7.5/960\n\nDCS-FRP-15\n200 TR\n3000\n3000\n2850\n1800\n3000\n3500\n10/960\n\nDCS-FRP-16\n250 TR\n3000\n3600\n2850\n1500X2\n4000\n3500\n5/960 X2\n\nDCS-FRP-17\n300 TR\n3600\n3600\n2900\n1800\n4400\n4300\n10/960\n\nDCS-FRP-18\n400 TR\n3000\n6000\n2900\n1800 X 2\n5000\n4500\n10/960 X2\n\n \n \nCompact design, lightweight and corrosion resistant.\n\nMinimum drift loss of water.\n\nPiping cost negligible and most suitable for small industrial unit.\n\nDurable service life.\n\nAesthetic design.\n\nMaintenance free.\n\nHigher efficiency (rate of cooling).\n\nNo contamination, due to dust or foreign particles.\n\nThe fan and the tower body specially designed to reduce noise.\n\nChecking up and maintenance jobs simplified.\n\nUnique mechanisms are applied to water distributing section. No moist formation water is distributed in the form of drops.\n\nThe tower utilizes corrosion-proof high efficiency fill.\n\nThe water collection sump of FRP is leak proof and avoids water spillage.\n\nThe ‘Bottle’ type design is highly resistant against strong wind.\n\n \n \n5 Tones to 600 Tones in Single Cell/Multiple cell.\n\n \n\n \n Related Portfolios \n\n \n\nSprinkler Fan\n\n \n\n \n\nWater Cooled Screw Chiller\n\n \n\n \n\nCold Room Panels\n\n \n\n \n\nRectangular Type Cooling Tower\n\n \n\n \n\n \n\nBrine Chillers\n\n \n\n \n\nAdsorption Dryers ( Heatless)\n\n \n\n \n\nFilters\n\n \n\n \n\nForced Draft Cooling Tower\n\n \n\n \n\n \n\nFlange Motor\n\n \n\n \n\nBottle Type Cooling Tower\n\n \n\n \n\nPVC Fills\n\n \n\n \n\nIndustrial Chillers"
  },
  "water-cooled-screw-chiller": {
    "title": "Water Cooled Screw Chillers (Single Compressor)",
    "description": "",
    "content": "Water Cooled Screw Chillers (Single Compressor)\n\n We are engaged in offering a wide range of Water Cooled Screw Chiller in Single Compressor, which is manufactured using quality screw compressors from bitzer (Germany) and frascold (Italy). Buy water cooled screw chiller in a very reasonable price.\n\nThese are offered with multiple screw compressors in one machine but have separate and individual refrigeration circuits. Fabricated in ISO certified manufacturing unit with an option of using CFC free refrigerants r-407c & r-134a complete with in-built process pump and stainless steel chilled water expansion tank. Our range of water cooled screw chiller is also rated for an ambient of up to (+) 50Â°c and cooling tower water temperature up to (+) 37°c at the inlet of the condenser. The chillers are fully microprocessor based and are suitable for process cooling applications from (+) 20°c up to (-) 40°c.\n\nThe various operating voltages of these chillers are:\n\n380 / 400 volt ac / 50 hz.\n\n460 volt ac / 50 hz.\n\n380 volt ac / 60 hz.\n\n460 volt ac / 60 hz.\n\n \n\n \n\n \n\n \n\nSingle Compressor\n\nFeatures\n\n \n\nModel \nCapacity (TR) \nQTY. \nFlow Rate (CMH) \n\nDCS-W-30\n30 TR \n1 \n18.0 \n\nDCS-W-40 \n40 TR \n1 \n24.0 \n\nDCS-W-50 \n50 TR \n1 \n30.0 \n\nDCS-W-57 \n57 TR \n1 \n34.2 \n\nDCS-W-75 \n75 TR \n1 \n45.0 \n\nDCS-W-90 \n90 TR \n1 \n54.0 \n\nDCS-W-100 \n100 TR \n1 \n60.0 \n\nDCS-W-120 \n120 TR \n1 \n72.0 \n\nDCS-W-145 \n145 TR \n1 \n87.0 \n\nDCS-W-166 \n166 TR \n1 \n99.6 \n\nDCS-W-185 \n185 TR \n1 \n111.0 \n\nDCS-W-245 \n245 TR \n1 \n147.0 \n\n \n \nTested in accordance with ARI / European standards.\n\nOil level switch and oil differential pressure switch.\n\nDischarge temperature protection with its controller.\n\nHighly reliable, efficient and low noise levels.\n\nLatest 5 to 6 patented profile design.\n\nPTC motor winding protection.\n\nBuilt – in oil separator.\n\n \n\n \n Related Portfolios \n\n \n\nIndustrial Chillers\n\n \n\n \n\nSquare Type Cooling Tower\n\n \n\n \n\nFlange Motor\n\n \n\n \n\nForced Draft Cooling Tower\n\n \n\n \n\n \n\nAir Handling Unit\n\n \n\n \n\nCold Room Refrigeration Equipments\n\n \n\n \n\nAir Cooled Scroll Chillers (Single Compressor)\n\n \n\n \n\nWater Cooled Scroll Chillers\n\n \n\n \n\n \n\nAir Cooled Scroll Chillers\n\n \n\n \n\nBottle Type Cooling Tower\n\n \n\n \n\nAdsorption Dryers ( Heatless)\n\n \n\n \n\nFilters"
  },
  "water-cooled-screw-chillers": {
    "title": "",
    "description": "We Manufacture screw chiller for industrial purpose like water cooled screw chiller, Air cooled screw chiller & inverter screw chiller.",
    "content": "Water Cooled Screw Chiller \n\nDrycool System’s water cooled screw chiller is specially designed to work even in extreme tropical weather conditions. They will still maintain high energy efficiency in any weather condition. We will offer the best possible equipment being the best chiller supplier in India. Our choice of equipment and the design is completely based on offering high-quality standards. We follow the international standard of manufacturing and testing for offering the best quality of equipment.\n\nBuy water cooled screw chiller in a very reasonable price with better quality. All the installed screw chiller are completely operation friendly which will be backed up by the skilled and experienced engineering team. Drycool Systems is the best chiller manufacturers in India who will offer high-quality tenders in fabricating the best manufacturing unit with the option of CFC-free refrigerants. The refrigerants which are used in water-cooled screw chiller are R407C & R134A. It is made out of a stainless-steel chilled water expansion tank along with a process pump to offer the best chilling condition.\n\n \n\n \n\n \n\n \n\n \nBuy Now \nOur precision range of Water Cooled Screw Chiller with Multiple Compressors is of world class quality and is fabricated in our state-of-the-art manufacturing unit having an option of using CFC free refrigerants r-407c & r-134a complete with in-built process pump and stainless steel chilled water expansion tank.\n\nscrew chillers are rated for an ambient of up to (+) 50°c and cooling tower water temperature up to (+) 37°c at the inlet of the condenser. Our range is manufactured using reputed screw compressors from bitzer (Germany) and frascold (Italy). Fully microprocessor based, these chillers are suitable for process cooling applications from (+) 20°c upto (-) 40°c. We offer these multiple screw compressors in one machine but having separate and individual refrigeration circuits.\n\nThe pillars are having the ability to maintain the range of (+) 50⁰C and for the cooling tower water temperature, it can be ranging around (+) 37⁰C. The temperature is consistently maintained at the inlet of the condenser which is the favorable equipment in the product. Every water-cooled screw chiller is integrated with a screw compressor coming from Frascold in Italy and Bitzer in Germany. They are completely microprocessor-based and it is much more suitable while processing cooling applications ranging from (+) 20⁰C up to (-) 40⁰C.\n\nIn our screw chiller we are having different water-cooled screw compresses installed in a single machine that is completely separate from the refrigeration circuits. This will give the advantage of maintenance with no downtime. The machine can be properly maintained and updated without any halting of the production in the industries. Drycool Systems is a renowned chiller manufacturer in India along with remarkable market growth in the industry.\n\nWe are offering various functionalities with water-cooled screw chillers which include easy operation, less maintenance, and hassle-free service life. Screw chillers are mostly used for cooling water in various industries including food processing, chemicals, etc.\n\nProminent Features of Drycool System’s Water Cooled Screw Chillers:\n\nIt is completely energy-efficient.\n\nGet operation-friendly refrigerants R134A.\n\nThe product is completely environmentally friendly.\n\nGet the latest reliable and efficient version of the screw compressor from Europe.\n\nPart load and full load energy efficiency using multiple and single refrigeration circuits.\n\nEvaporator and DX are completely factory-made and tested. They are made by maintaining the high International standard of manufacturing.\n\nGet precise temperature control along with increased efficiency through electronic expansion valves.\n\nAmazing is having a fully automatic PLC unit which is useful for data logging facilities and remote operation.\n\nGet the complete excess capacity control with 25% to 100% adaptive varying process load.\n\nIt is having high following factors with extra tube thickness, increase condensing area, and high floor design. It will offer high operational reliability, high energy efficiency along easy maintenance.\n\nIt is also having TC motor winding protection.\n\nBuilt-in oil separator.\n\nDischarge temperature controller along with protection.\n\nCompletely efficient and reliable with low noise levels.\n\nIt is tested according to the European standards and ARI.\n\n5 to 6 patented profile design.\n\nGet extreme oil level switch with proper differential pressure switch.\n\nExcellent performance along with smooth operation.\n\nEco-friendly and robust construction.\n\nGet quick chilling functionality.\n\nUser-friendly design.\n\nHigh quality with long working life.\n\nLow maintenance cost.\n\nAdvantages of Drycool System’s Water Cooled Screw Chiller:\n\nWater-cooled chillers are having capabilities for handling large cooling loads as the equipment will be using the water evaporation technique to dissipate heat. This technique is fully energy-intensive compared to blowing air around hot surfaces. The blowing air technique is used by Air Cooled Screw Chiller which is completely different from Water Cooled Screw Chiller. Water is having more heat capacity compared to air and it can easily remove heat compared to air.\n\nWater Cooled Screw Chiller is having capabilities of handling large loads according to the floor space by comparison to Air Cooled Screw Chillers.\n\nAll the Water Cooled Screw Chiller are having a simple design and do not need a second set of pumps for the condenser.\n\nEvery Water Cooled Screw will last longer as they are generally placed inside the building and its deterioration rate is much slower compared to Air Cooled Screw Chiller.\n\nThe various operating voltages of these chillers are:\n\n380 / 400 volt ac / 50 hz.\n\n460 volt ac / 50 hz.\n\n380 volt ac / 60 hz.\n\n460 volt ac / 60 hz.\n\nMultiple Compressors\n\nFeatures\n\n \n\nModel \nCapacity (TR) \nQTY. \nFlow Rate (CMH) \n\nDCM-W-60 \n60 TR \n2 \n36.0 \n\nDCM-W-80 \n80 TR \n2 \n48.0 \n\nDCM-W-100 \n100 TR \n2 \n60.0 \n\nDCM-W-115 \n115 TR \n2 \n69.0 \n\nDCM-W-150 \n150 TR \n2 \n90.0 \n\nDCM-W-175 \n175 TR \n2 \n105.0 \n\nDCM-W-250 \n250 TR \n2 \n150.0 \n\nDCM-W-300 \n300 TR \n2 \n180.0 \n\nDCM-W-350 \n350 TR \n2 \n210.0 \n\n \n \nTC motor winding protection.\n\nOil level switch and oil differential pressure switch.\n\nLatest 5 to 6 patented profile design.\n\nHighly reliable, efficient and low noise levels.\n\nBuilt – in oil separator.\n\nDischarge temperature protection with its controller.\n\nTested in accordance with ARI / European standards.\n\n \n\n \n Related Portfolios \n\n \n\nAir Receivers\n\n \n\n \n\nCold Room Panels\n\n \n\n \n\nCold Room Doors\n\n \n\n \n\nAir Cooled Scroll Chillers\n\n \n\n \n\n \n\nAmmonia Milk Chillers\n\n \n\n \n\nSprinkler Fan\n\n \n\n \n\nRefrigerated Air Dryers\n\n \n\n \n\nBottle Type Cooling Tower\n\n \n\n \n\n \n\nSquare Type Cooling Tower\n\n \n\n \n\nAir Cooled Scroll Chillers (Single Compressor)\n\n \n\n \n\nAir Handling Unit\n\n \n\n \n\nWater Cooled Scroll Chillers"
  },
  "water-cooled-scroll-chiller": {
    "title": "Water Cooled Scroll Chillers ( Single Compressor)",
    "description": "",
    "content": "Water Cooled Scroll Chillers (Single Compressor)\n\n We are offering Water Cooled Scroll Chiller which are fabricated with globally renowned scroll compressors from danfoss-maneurop and Copeland. Our range of chillers is fully microprocessor based and suitable for process cooling applications from (+) 20°c up to (-) 15°c and for lower temperatures of up to (-) 50°c please refer brine chillers. Offered with multiple scroll compressors in one machine but having separate and individual refrigeration circuits, these chillers are also rated for an ambient of up to (+) 480c and cooling tower water temperature up to (+) 37°c at the inlet of the condenser. We manufacture our range in an ISO 9001 certified unit, with an option of using CFC free refrigerant r-407c & r-134a complete with in-built process pump and stainless steel chilled water expansion tank.\n\nThe various operating voltages of these chillers are:\n\n380 / 400 volt ac / 50 hz.\n\n460 volt ac / 50 hz.\n\n380 volt ac / 60 hz.\n\n460 volt ac / 60 hz.\n\n \n\n \n\n \n\n \n\nDesign data\n\nSpecifications\n\nFeatures\n\n \n \nConnected power 415v ac +/- 10% / 50 Hz / 3 phase + neutral.\n\nDesign condensing temperature (+) 40 ° c.\n\nDesign evaporating temperature (+) 5 ° c.\n\n \n\n \n \n \n\nMODEL\nCAPACITY\nCOMPRESSORS\nFLOW RATE\n\nDCS WST \nTR\n \nCMH\n\nDCS-W-3\n3 TR\n1\n1.8\n\nDCS-W-6\n6 TR\n1\n3.6\n\nDCS-W-8\n8 TR\n1\n4.8\n\nDCS-W-11\n11 TR\n1\n6.6\n\nDCS-W-12\n12 TR\n1\n7.2\n\nDCS-W-15\n15 TR\n1\n9.0\n\nDCS-W-20\n20 TR\n1\n12.0\n\nDCS-W-25\n25 TR\n1\n15.0\n\nDCS-W-30\n30 TR\n1\n18.0\n\n \n \nInnovative design.\n\nVery low input KW/TR.\n\nCFC free refrigerant.\n\nRobust in construction.\n\nDeveloped with state of art technology.\n\nLiquid injection for enhanced compressor life.\n\nMCS microprocessor/PLC based/electromechanical.\n\nHeat exchanger design as per TElvlA/ASME/SEC VIII, DM, 2001.\n\n \n\n \n Related Portfolios \n\n \n\nPlate Heat Exchanger\n\n \n\n \n\nIndustrial Chillers\n\n \n\n \n\nCold Rooms\n\n \n\n \n\nAdsorption Dryers ( Heatless)\n\n \n\n \n\n \n\nRotary Sprinkler\n\n \n\n \n\nRectangular Type Cooling Tower\n\n \n\n \n\nRefrigerated Air Dryers\n\n \n\n \n\nAir Cooled Screw Chillers\n\n \n\n \n\n \n\nAir Washer\n\n \n\n \n\nWater Cooled Screw Chillers (Single Compressor)\n\n \n\n \n\nAir Cooled Screw Chillers (Single Compressor)\n\n \n\n \n\nSprinkler Fan"
  },
  "water-cooled-scroll-chillers": {
    "title": "Water Cooled Scroll Chillers",
    "description": "",
    "content": "Water Cooled Scroll Chillers (Multiple Compressor)\n\n Drycool Scroll chillers are state-of-the-art liquid chiller for a wide range of comfort and process-cooling applications. These scroll chillers are complete, factory-assembled liquid chiller that offers ease of installation with wiring and controllers providing maximum operating efficiency. Our compact liquid scroll chillers can be easily installed.\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\nSpecifications\n\n \n\nMODEL\nCAPACITY\nCOMPRESSORS\nFLOW RATE\n\nDCM WST \nTR\n \nCMH\n\nDCM-W-6\n6 TR\n2\n3.6\n\nDCM-W-12\n12 TR\n2\n7.2\n\nDCM-W-16\n16 TR\n2\n9.6\n\nDCM-W-22\n22 TR\n2\n13.2\n\nDCM-W-24\n24 TR\n2\n14.4\n\nDCM-W-30\n30 TR\n2\n18.0\n\nDCM-W-40\n40 TR\n2\n24.0\n\n \n\n \n Related Portfolios \n\n \n\nAir Cooled Screw Chillers (Single Compressor)\n\n \n\n \n\nAir Cooled Scroll Chillers (Single Compressor)\n\n \n\n \n\nFilters\n\n \n\n \n\nAir Cooled Scroll Chillers\n\n \n\n \n\n \n\nAmmonia Milk Chillers\n\n \n\n \n\nForced Draft Cooling Tower\n\n \n\n \n\nIndustrial Chillers\n\n \n\n \n\nSquare Type Cooling Tower\n\n \n\n \n\n \n\nAir Cooled Screw Chillers\n\n \n\n \n\nCold Room Panels\n\n \n\n \n\nBottle Type Cooling Tower\n\n \n\n \n\nRotary Sprinkler"
  },
  "water-flow-switch": {
    "title": "Water flow switch",
    "description": "",
    "content": "Water flow switch\n\n We Supply Water flow switch.\n\n \n\n \n\n \n\n \n\nFeatures\n\n \nHigh performance.\n\nSturdy construction.\n\nLonger service life."
  }
}